[
  {
    "title": "Senior Automation Engineer - Power Systems",
    "description": "The Senior Automation / Power Systems Engineer will primarily be responsible for the conception, design, development, and implementation of electrical systems. The candidate should have extensive knowledge of electrical power systems, AC drive technology, Active Front End (AFE) systems, and some PLC programming experience. The candidate should also possess the ability to apply mathematical and engineering principles.\nDetailed Description:Responsible for designing and developing electrical systems including: generator controls, switchboards, AC or DC drives, Active Front Ends (AFE), motor control systems, panel boards and other components required for a functioning system according to customer specification.Responsible for power system simulations, analysis, and engineering of complex power systems (both microgrid and large utility)Experience analyzing harmonics and corrective measures for complex power systemsExperience specifying, designing, and implementing Active Front End (AFE) systems on multiple generator systems (non-utility feeds)Experience analyzing and rationalizing power system quality metrics through theoretical and experimental approaches (does theory match actual system performance – yes or why not?)Experience designing, implementing, and commissioning multiple generator systems on an isolated gridProvide continued support for projects after completion and field commissioning by phone in the form of troubleshooting or in person onsite when required.\nJob Requirements:Ability to work independently as well as part of a team, managing multiple tasks and working on multiple projects simultaneously to meet challenging deadlines.Demonstrate clear written and verbal communication skills and ability to promptly give, and follow directions when working with others.Safely navigate work sites including regular walking, climbing, standing, stepping, etc. during various weather conditions (day/night, outdoor hot/cold weather).Proficiently use MS Office Suite to develop presentations, correspondence, reports, and schedules (Word, Excel, Power Point, etc.).Lift and carry 50 pounds independently while walking on uneven surfacesBend, stoop, kneel, twist, and crawl occasionally during visits to field and operational work areas.Listen for unusual noises that signify equipment and or machinery problems.Stay alert and focused including during occasional extended work periods.Maintain spatial orientation and awareness to safely move around work environment with many moving objects including overhead machinery.Wear Personal Protective Equipment (PPE) at all designated times.Ability to regularly travel as needed to visit work sites and support business units; may require extended travel to remote locations and/or overnight Stay(s) outside normal office area.Ability to work on weekends and be on call after hours as needed.\nMinimum QualificationsDegree related to Electrical Engineering or Design5+ years of proven experience with electrical systems and AC / AFE drive systems.Experience with standard field bus communications protocols. (Ethernet/IP, Profibus, Profinet, CANBUS, OPC UA, etc.).Experience with Autocad Electrical.\nPreferred Qualifications 7+ years of proven experience with electrical system design and analysis.Master’s level electrical engineering degreeProven experience with VFD drives and AFE drive systems preferably with GE and Siemens.Proven experience with multiple generator power system design, simulations, analysis, commissioning, and field supportProven experience with equipment used in the drilling, marine, and mining industries.\n Additional Details:Work is primarily in a climate controlled / office environment with minimal safety / health hazard potential. The employee is regularly required to sit, stand, or walk with occasional lifting (overhead, waist level) from floor, bending and frequent near vision use for reading and use of computer, telephone and other office equipment. Employee must work with an emphasis on safety for themselves and others, including coworkers and third parties, including wearing any required personal protective equipment (PPE) at all designated times. This position may require the employee to work in a shop environment or field based location in all types of weather conditions typical of the area where the job is located, including dust, humidity, sleet, snow, rain, mud, cold, heat, wind, and other inclement weather. Working conditions for this position may involve exposure to varying outdoor conditions, including environmental chemicals, gases, noise, dampness, fumes, radiation and heights.",
    "location": "Houston, TX",
    "application_url": "https://fa-elpm-saasfaprod1.fa.ocs.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX/job/1883/?utm_medium=jobshare&utm_source=link#.Y-KF-vwHpWQ.link",
    "keywords": [
      "Senior Automation Engineer",
      "Power Systems",
      "Electrical Engineering",
      "AC Drive Technology",
      "Active Front End (AFE)",
      "PLC Programming",
      "Generator Controls",
      "Switchboards",
      "Motor Control Systems",
      "Power System Simulations",
      "Microgrid",
      "Harmonics Analysis",
      "Multiple Generator Systems",
      "AutoCAD Electrical",
      "VFD Drives",
      "Field Bus Communications",
      "Ethernet/IP",
      "Profibus",
      "System Commissioning",
      "GE Siemens"
    ]
  },
  {
    "title": "DISH Installation Technician - Field",
    "description": "Company Summary\n\nDISH, an EchoStar Company, has been reimagining the future of connectivity for more than 40 years. Our business reach spans satellite television service, live-streaming and on-demand programming smart home installation services, mobile plans and products, and now we are building America’s First Smart Network™.\n\nToday, our brands include EchoStar, Hughes, DISH TV, Sling TV, Boost Infinite, Boost Mobile, DISH Wireless, OnTech and GenMobile.\n\nDepartment Summary\n\nOur Technicians deliver TV and Smart Home solutions to millions of customers. As a technician, we will train you to lead the charge for a world-class customer experience, educating and connecting more Americans with every home you visit. You’re the backbone of our organization and ensure an excellent customer experience. Our dedication to customer experience is paying off: in 2023, DISH earned the J.D. Power award for being #1 in Overall Customer Satisfaction for the sixth year in a row.\n\nJob Duties And Responsibilities\n\nWhat’s in it for you?\n\nGuaranteed promotion after 6 months with a $1.00 per hour pay increase! Performance Incentives with the potential for up to $6,400 in your first year and $9,100 each following year!Paid training, paid time off & paid holidays4-day work week with opportunities to work overtimeMedical, Dental, Vision and Life Insurance packages and Health Savings AccountFree DISH TV programming at a value of $114.99/month at your home, plus deeply discounted Sling TV and Boost Infinite phone plans401(K) with company match & Employee stock purchasing program (ESPP)Tuition ReimbursementDISH-supplied van, tools, and uniforms\n\nOur greatest benefit is opportunity with over 400 of our current technician leadership starting as a technician. If you have grit and tenacity, you will grow quickly at DISH! Performance based promotions include an automatic 5% pay increase at level 2 and 10% at levels 3 and 4.\n\nWhat will you be doing?\n\nAs a Field Technician, you will be representing DISH in customers' homes daily. We build our value by simplifying lives and using the DISH install to consult homeowners on their infinite smart home possibilities.\n\nSkills, Experience And Requirements\n\nAll technicians must have:\n\nAptitude to build rapport quickly. We want you to have a great time servicing our clientsAbility to work at heights, including ladders up to 40 feet, and in all weather conditionsAbility to lift over 70 lbsA valid driver's license in the state you are seeking employment with a driving record that meets DISH's safety standardTravel may be required\n\nSalary Ranges\n\nCompensation: $19.75/Hour\n\nBenefits\n\nFrom versatile health perks to new career opportunities, check out our benefits on our careers website.\n\nEmployment is contingent on successful completion of a pre-employment screen, to include a drug test and an acceptable driving record. Compensation listed may reflect a combination of hourly pay rate and location pay differential.\n\nThis will be posted for a minimum of 3 days or until the position is filled.",
    "location": "Orange, TX",
    "application_url": "https://jobs.dish.com/jobs/82101?lang=en-us&utm_source=Linkedin",
    "keywords": [
      "DISH Installation Technician",
      "Field Technician",
      "Satellite Television",
      "TV Installation",
      "Smart Home",
      "Customer Service",
      "Technician Training",
      "Valid Driver's License",
      "Work at Heights",
      "Lift 70 lbs",
      "All Weather Conditions",
      "Van Provided",
      "Tools Provided",
      "Performance Incentives",
      "Paid Training",
      "4-day Work Week",
      "Medical Benefits",
      "Career Advancement",
      "EchoStar",
      "$19.75/Hour"
    ]
  },
  {
    "title": "Order Builder",
    "description": "Division: North Alabama\n\nDepartment : Oxford Warehouse Loading\n\nWork Schedule: M-F 8 am UNTIL finished\n\nFrom $34,457 annually\n\nWhy you will love Coca-Cola UNITED?\n\nAbout Us\n\nPrivately owned and operated with 100+ years of historical strength and stabilityDedicated to supporting internal career growth through on job training, learning and opportunity for career advancementExcellent Total Value Benefits Package to include:Two weeks paid vacation within first yearComprehensive Medical Preferred Provider Plan ($35 physical copay; $15 Teladoc copay)Dental, vision, flex spendingEmployee Assistance ProgramCompany paid life insurance ($50,000)Additional optional insurance (accident, critical illness, universal life, home & auto)Paid maternity & paternity leavePaid holiday & sick time401(k) match (50% on first 6%; plus an additional annual match of up to 3%)Exclusive employee discounts (cell phone, event tickets, gym membership, car buying, hotels, car rentals, technology needs and much more)Competitive Compensation Fast paced environment promotes a healthy lifestyleFor qualified candidates we offer an amazing CDL Tuition Program reimbursable up to $5250 for CDL school tuition – ask your Recruiter for details \n\nJob Description\n\nThe Material Handler-Loader is responsible for filling customer orders with tickets or voice by performing the following duties\n\nWhat Your Day Will Look Like\n\nFills orders from tickets according to set quotasOrders filled manually by walking and use of pallet jack and/or riding jacksIdentify product by description and quantity then removing product from area and carrying to the staging areaCheck for accuracy in pickingGeneral housekeepingComplete daily powered equipment inspection formReads customer order, work order, shipping order, or requisition to determine items to be moved, gathered, or distributedSorts and places materials or items on pallets according to predetermined sequence such as size, type, or product codeMarks materials with identifying informationRecords amounts of materials or items received or distributedCount items for distribution within plant to ensure conformance to Company standardsPerforms appropriate duties as assigned by management\n\nWhat You Need To Succeed\n\nMinimum age of 18 years oldPersonal Protective Equipment (PPE) as required by position and compliance with UNITED safety policiesRegular and prompt attendance is an essential function of the jobAbility to read, write and speak EnglishAbility to maintain a neat professional appearance within Company guidelinesAbility to maintain safety and security of Company assetsAbility to utilize all Company provided resources and technologyLess than high school education; or up to 1 months related experience or training; or equivalent combination of education and experienceForklift and electric riding pallet jack experience preferredRepeatedly graspingContinuous standing, walking, bending, kneeling, squatting, pushing, pulling and frequent lifting, carrying, pushing, pulling up to 50lbs.Ability to effectively adapt to changeAbility to demonstrate initiativeAbility to work safely and securelyWillingness to work weekends, holidays, or flexible schedule as required\n\nCCBCU is an Equal Opportunity Employer Minorities/Women/Veterans/Disabled. Veteran friendly.",
    "location": "Oxford, AL",
    "application_url": "https://careers.cokeonena.com/united/job/Oxford-Order-Builder-AL-36203/1156817700/?utm_source=LINKEDIN&utm_medium=referrer",
    "keywords": [
      "Order Builder",
      "Material Handler",
      "Loader",
      "Warehouse",
      "Coca-Cola",
      "Filling orders",
      "Voice picking",
      "Tickets",
      "Pallet jack",
      "Product identification",
      "Accuracy checking",
      "Forklift",
      "Electric riding pallet jack",
      "Lifting 50lbs",
      "PPE",
      "Safety compliance",
      "Physical demands",
      "Standing",
      "Walking",
      "English proficiency",
      "High school education"
    ]
  },
  {
    "title": "Mountain Multimedia Journalist, KMGH",
    "description": "KMGH, the E.W. Scripps Company ABC affiliate in Denver, Colorado is looking for a Multimedia Journalist to live and work in one of Colorado’s beautiful mountain communities. This is not an entry-level position. This role is perfect for someone who truly loves solo storytelling and is just looking for the right backdrop. The ideal candidate will be curious about meeting new people and finding the stories that are important to them. This job is all about variety – you’ll cover everything from challenges around affordable housing in ski communities to wildfire preparedness and some of the amazing outdoor recreation Colorado has to offer. While you’ll primarily work independently, you will have opportunities to visit our Denver newsroom to collaborate and train with leadership and colleagues. You’ll also team up with a photojournalist during breaking news.\n\nWHAT YOU'LL DO:\n\nReceive assignments or evaluate news leads and news tips to develop story ideas.Gather and verify factual information regarding stories through interview, observation, and research.Organize material, determine slant or emphasis, and writes story according to prescribed editorial style and format standards.Shoot video and still photos to illustrate stories.Edit, or assist in editing, videos for all multimedia platforms.Appear on TV in packaged reports.Go live from site of event or mobile broadcast unit.Work cooperatively with photographer assigned to story if one is assigned.Assist news producer in preparing newscast.Assist online staff in preparing for multimedia stories.Report, write, capture quality visual content, edit and produce stories for multiple platforms on deadline, such as Internet and digital channels.\n\nWHAT YOU'LL NEED:\n\nBachelor's degree in broadcast journalism or related degree or equivalent years of experience.Generally, 3+ years of experience in related field preferred.\n\nWHAT YOU'LL BRING:\n\nComputer literacy required, including newsroom computer systems.Videography and non-linear editing experience preferred.Knowledge of broadcast quality camera equipment.Edit video on Final Cut Pro editing systems, or similar equipment.Strong broadcast and AP-style writing skills.Proficient at posting content to various websites.Self-motivated and able to work in a fast-paced deadline-driven environment.Must be able to lift up to 50 pounds.Valid driver's license and good driving record required. In addition, proof of insurance and liability coverage may be required.\n\nCOMPENSATION RANGE:\n\nAnnual Salary: $80,000.00 - $85,000\n\nPursuant to state and local salary transparency laws, the salary range posted is specific to candidates who will perform this work in Colorado.\n\nWHAT WE OFFER (ADDITIONAL BENEFITS):\n\nA career path to grow your professional experiencesFull medical, dental and vision benefits, as well as certain other health and wellness benefitsRetirement savings plan with company matchOther key company benefits include disability accident insurance, hospital indemnity, critical illness, life insurance, AD&D, ID protection, pet discount program, and employee assistance program. More details about timing and conditions of benefits eligibility and other plan terms and conditions will be provided upon hire.\n\nIf you are a current Scripps employee, please do not apply on this site. Please access our internal career site at Worklife > My Info > View Open Positions at Scripps.\n\nSCRIPPS' COMMITMENT TO EQUITY, DIVERSITY AND INCLUSION:\n\nAt Scripps, we are committed to a diverse and inclusive culture that reflects the communities we serve. We are intentional about creating an environment where employees, our audiences and other stakeholders feel valued and inspired to reach their full potential and make authentic connections. We foster a workplace culture that embraces each person’s diversity, including the extent to which they are similar or different. Scripps leaders believe that an equitable and inclusive culture is not only the right thing to do, it is a business imperative. Read more about our commitment to equity, diversity and inclusion at scripps.com.\n\nABOUT SCRIPPS:\n\nThe E.W. Scripps Company (NASDAQ: SSP) is a diversified media company focused on creating a better-informed world. As one of the nation’s largest local TV broadcasters, Scripps serves communities with quality, objective local journalism and operates a portfolio of more than 60 stations in 40+ markets. Scripps reaches households across the U.S. with national news outlets Scripps News and Court TV and popular entertainment brands ION, Bounce, Defy TV, Grit, ION Mystery and Laff. Scripps is the nation’s largest holder of broadcast spectrum. Scripps is the longtime steward of the Scripps National Spelling Bee. Founded in 1878, Scripps’ long-time motto is: “Give light and the people will find their own way.”\n\nAs an equal employment opportunity employer, The E.W. Scripps Company and its affiliates do not discriminate in its employment decisions on the basis of race, sex, sexual orientation, transgender status, gender, color, religion, age, genetic information, medical condition, disability, marital status, citizenship or national origin, and military membership or veteran status, or on any other basis which would be in violation of any applicable federal, state or local law. Furthermore, the company will make reasonable accommodations for qualified individuals with known disabilities unless doing so would result in an undue hardship for the company.\n\n",
    "location": "Denver, CO",
    "application_url": "https://scripps.wd5.myworkdayjobs.com/Scripps_Careers/job/Denver-CO---KMGHKCDOKSBSKZCO/Mountain-Multimedia-Journalist--KMGH_JR033481-1",
    "keywords": [
      "Multimedia Journalist",
      "videography",
      "broadcast journalism",
      "storytelling",
      "video editing",
      "Final Cut Pro",
      "photography",
      "live reporting",
      "breaking news",
      "AP style writing",
      "newsroom systems",
      "camera equipment",
      "deadline-driven",
      "self-motivated",
      "Bachelor's degree",
      "3+ years experience",
      "Colorado mountains",
      "solo reporting",
      "news production",
      "digital platforms"
    ]
  },
  {
    "title": "Licensed Practical Nurse (LPN)",
    "description": "Come for the Flexibility, Stay for the Culture\n\nNeeding more ‘life’ in your work-life balance? Apply to our talent network today!\n\nBAYADA Offers Our LPNs\n\nOne on one careFlexible scheduling based on your preferencesWeekly payPreventive Care Coverage for ALL employees (PRN included)PTOShort commute times – we match you with cases nearest youMedical, Dental, and Vision benefitsCompany-paid life insuranceEmployee Assistance Program401KCareer advancement and training\n\nBAYADA Home Health Care was founded on the principle that health care gets better when clients get better care at home—the place they most want to be. Delivering care is our highest priority and greatest joy.\n\nHow We Prepare Our LPNs For Success\n\nPaid training from day 1 in the office, in the home, and onlinePractice with award-winning adult and pediatric Simulation labsAround the clock clinical support by phoneElectronic charting using AlayaCare\n\nWe care for clients of all ages, diagnoses, and acuity levels. We offer a multitude of paid training to our nurses to feel comfortable and competent on their first shift.\n\nAvailable LPN Shifts\n\n8, 10 or 12 hour shifts1st, 2nd or 3rd shiftWeekdays and Weekends\n\nRequirements\n\nCurrent valid nursing license in the U.S.Graduation from a qualified nursing program\n\nPay: [$30- $35 per hour]\n\nApply now to join our team!\n\nNER-NJ-RX\n\nAs an accredited, regulated, certified, and licensed home health care provider, BAYADA complies with all state/local mandates.\n\nBAYADA Home Health Care, Inc., and its associated entities and joint venture partners, are Equal Opportunity Employers. All employment decisions are made on a non-discriminatory basis without regard to sex, race, color, age, disability, pregnancy or maternity, sexual orientation, gender identity, citizenship status, military status, or any other similarly protected status in accordance with federal, state and local laws. Hence, we strongly encourage applications from people with these identities or who are members of other marginalized communities.",
    "location": "Teterboro, NJ",
    "application_url": "https://jsv3.recruitics.com/redirect?rx_cid=3588&rx_url=https%3A%2F%2Fjobs.bayada.com%2Fen%2Fjobs%2F7339335002%2Flicensed-practical-nurse-lpn%2F%3Fgh_src%3D7fll266v2%26rx_campaign%3DLinkedin1%26rx_ch%3Dconnector%26rx_group%3D312058%26rx_job%3D7339335002%26rx_medium%3Dpost%26rx_r%3Dnone%26rx_source%3DLinkedin%26rx_ts%3D20240419T064838Z%26rx_vp%3Dslots&rx_jobId=7339335002&gh_src=7fll266v2",
    "keywords": [
      "Licensed Practical Nurse",
      "LPN",
      "home health care",
      "one on one care",
      "flexible scheduling",
      "weekly pay",
      "medical benefits",
      "401K",
      "paid training",
      "clinical support",
      "nursing license",
      "nursing program",
      "8 hour shifts",
      "12 hour shifts",
      "weekdays",
      "weekends",
      "BAYADA",
      "electronic charting",
      "AlayaCare",
      "equal opportunity employer"
    ]
  },
  {
    "title": "Human Resources Project Manager",
    "description": "Hybrid roleOnsite: required to work onsite at office 1-2 days/week (up to 5 days/week during busy periods in May/June)Hours per week: 30-40 hours depending on workload\nMust Haves: 5+ YOE in HR Project Management Smartsheets, or similar tools Creating HR training programs Creating HR communications for enterprise organizations Working with confidential information Skill / experience required: Experience with HR project management Experience managing complex employee events Ability to work with senior leaders Ability to work with highly confidential information Description: Provide HR project management for an operating model transformation, including employee events, new team formation, and engagement with leaders Provides project management and HR business partner staff support to optimize operating model transformation Develop and maintain project documentation, including project plans, status reports, issue logs, and change control documentation. Development materials to support change management, learning & development, teaming, and onboarding Manage project risks and issues, and develop mitigation strategies to ensure project success. Conduct regular meetings with project teams to provide updates on project status, discuss challenges, and make recommendations for improvement. Manages stakeholder expectations and provides guidance and advice throughout project duration. Fosters and maintains good relationships with HR colleagues to ensure that processes are maintained and supported following project completion. Other related duties as assigned Nice to Haves:SHRM-CP certificationPMP certification",
    "location": "Boston, MA",
    "application_url": null,
    "keywords": [
      "HR Project Management",
      "Smartsheets",
      "Employee Events",
      "Training Programs",
      "HR Communications",
      "Confidential Information",
      "Operating Model Transformation",
      "Change Management",
      "Project Documentation",
      "Stakeholder Management",
      "Senior Leaders",
      "Team Formation",
      "Learning & Development",
      "Onboarding",
      "Risk Management",
      "Status Reports",
      "HR Business Partner",
      "SHRM-CP",
      "PMP Certification",
      "Enterprise Organizations"
    ]
  },
  {
    "title": "Clinical Paramedic",
    "description": "An exciting career awaits you\n\nAt MPC, we’re committed to being a great place to work – one that welcomes new ideas, encourages diverse perspectives, develops our people, and fosters a collaborative team environment.\n\nPOSITION SUMMARY:\n\nMarathon Petroleum Co. is seeking a Paramedic to administer, organize, coordinate and provide Occupational Health Services to employees. This is done within the boundaries of the State Authorized EMS certified provider scope of practice and Company policies, guidelines and protocols. This position will be providing services to Marathon Petroleum employees and contractors at the Garyville LA Refinery Occupational Health Clinic.\n\nKEY RESPONSIBILITIES:\n\nProvides onsite evaluation of illnesses/injuries including follow-up care in collaboration with registered nurse, advanced practice clinician or collaborating medical doctor, based on initial complaint and exam findings for employees and contractors, as allowed by the Paramedic’s scope of practice.Develops and maintains relationships with the workforce at large to foster trust and encourage reporting of all injuries.Assists in all aspects of patient care in support of total worker health and wellbeing including illness/injury evaluation, OSHA mandated medical surveillance exams, drug and alcohol specimen collections, and blood specimen collections.Provides administrative support including answering phones, maintaining the clinic schedule, ordering supplies, and maintaining clinic inventories as directed.Provides onsite training/education on emergency medical response topics including CPR, first aid, AED, HF acid exposures (if applicable).Acts as SME for emergency medical response with local Emergency Response Team.Provides routine and emergent medical response to incidents including afterhours call and provide staffing support/afterhours coverage for projects, outages, turnaround (TAR).Maintains an understanding of current health regulations, OSHA exam requirements, and treatment guidelines for common exposures.Maintain Health Insurance Portability and Accountability Act (HIPAA) compliance while promoting a professional, customer-focused, and collaborative environment.\n\nEDUCATION AND EXPERIENCE: \n\nHigh School Diploma or GED equivalent; Active & unencumbered Paramedic License and/or National Certification as required in state of employment or practice.Minimum of 3-5 years’ experience as a paramedic;1-2 years’ experience in an occupational health setting desired Certifications in Drug Collections and Breath Alcohol Testing and Spirometry desired.Certifications in First Aid and CPR/AEDFamiliar with state and federal requirements related to practice including OSHA, DOT, ADA, HIPAA, FMLA, and Workers’ Compensation Must possess a valid driver’s licenseMust be able to pass drug test and background check\n\nSKILLS:\n\nBlood work/venipuncture competenceAble to prioritize, multi-task, and be flexible Strong problem solving, analytical skills, and attention to detail Ability to speak clearly and effectively in a variety of settings and during interactions with employees, patients, providers, and other colleagues Ability to use tact and diplomacy appropriate to the situation and maintain effective work relationships with all levels of colleagues Excellent customer service skills \n\nPHYSICAL REQUIREMENTS: \n\nWhile performing the duties of this job, the employee is frequently required to sit. The employee is regularly required to stand; walk; reach with hands and arms; stoop, kneel, crouch, or crawl; talk and hear. The employee must occasionally lift and/or move up to 30 pounds. Specific vision abilities required by this job include close vision. The worker is required to have visual acuity and be capable of operating and viewing computers and other electronic devices for extended periods of time.\n\nWORKING CONDITIONS:\n\nThe environment is a fast-paced, deadline-oriented medical office environment. There will be access to confidential and sensitive information, requiring ongoing discretion and secure information management in paper and electronic form. The medical department is located within a secured petroleum refinery.\n\nTRAVEL EXPECTED: \n\nLess than 10% travel is expected.\n\nAs an energy industry leader, our career opportunities fuel personal and professional growth.\n\nLocation:\n\nGaryville, Louisiana\n\nAdditional locations:\n\nJob Requisition ID:\n\n00011542\n\nLocation Address:\n\nHwy #61 Marathon Ave\n\nEducation:\n\nHigh School (Required)\n\nEmployee Group:\n\nFull time\n\nEmployee Subgroup:\n\nRegular\n\nMarathon Petroleum Company LP is an Equal Opportunity Employer and gives consideration for employment to qualified applicants without discrimination on the basis of race, color, religion, creed, sex, gender (including pregnancy, childbirth, breastfeeding or related medical conditions), sexual orientation, gender identity, gender expression, reproductive health decision-making, age, mental or physical disability, medical condition or AIDS/HIV status, ancestry, national origin, genetic information, military, veteran status, marital status, citizenship or any other status protected by applicable federal, state, or local laws. If you would like more information about your EEO rights as an applicant, click here.\n\nIf you need a reasonable accommodation for any part of the application process at Marathon Petroleum LP, please contact our Human Resources Department at talentacquisition@marathonpetroleum.com. Please specify the reasonable accommodation you are requesting, along with the job posting number in which you may be interested. A Human Resources representative will review your request and contact you to discuss a reasonable accommodation. Marathon Petroleum offers a total rewards program which includes, but is not limited to, access to health, vision, and dental insurance, paid time off, 401k matching program, paid parental leave, and educational reimbursement. Detailed benefit information is available at https://mympcbenefits.com.The hired candidate will also be eligible for a discretionary company-sponsored annual bonus program.\n\nEqual Opportunity Employer: Veteran / Disability",
    "location": "Garyville, LA",
    "application_url": "https://mpc.wd1.myworkdayjobs.com/en-US/MPCCareers/job/Garyville-Louisiana/Clinical-Paramedic_00011542",
    "keywords": [
      "Paramedic",
      "Occupational Health",
      "EMS",
      "OSHA",
      "Marathon Petroleum",
      "Refinery",
      "Medical Surveillance",
      "Drug Testing",
      "Blood Collection",
      "HIPAA",
      "CPR",
      "First Aid",
      "AED",
      "Emergency Response",
      "Venipuncture",
      "Patient Care",
      "Garyville Louisiana",
      "Clinical",
      "Healthcare",
      "Medical"
    ]
  },
  {
    "title": "CCTV/Access Control Installer (regional travel)",
    "description": "Want to learn more about this role and Jobot? Click our Jobot logo and follow our LinkedIn page!\n\nJob details\n\nRegional electronic security integrator seeking low voltage technicians- cctv video surveillance access control alarm\n\nThis Jobot Job is hosted by Nick Lanska\n\nAre you a fit? Easy Apply now by clicking the \"Easy Apply\" button and sending us your resume.\n\nSalary $35 - $40 per hour\n\nA Bit About Us\n\nPosition performs tasks involving the installation of electronic security systems to include alarm systems, cameras and digital video recorders, and access control systems. Training will be provided for the specific products we offer\n\n\n\nWhy join us?\n\n\nWe offer a competitive salary, complete benefits package, 401(k), tuition reimbursement and more.\n\nJob Details\n\nMust have 2+ years of cctv/video surveillance/alarm- electronic security experience\n\nOpen to travel few times week\n\nSelf starter- work well on own\n\nPass background check\n\nDMP/Lenel/Bosch/Honeywell/Verint/March Networks/Hanwha\n\nInterested in hearing more? Easy Apply now by clicking the \"Easy Apply\" button.\n\nWant to learn more about this role and Jobot?\n\nClick our Jobot logo and follow our LinkedIn page!\n\n",
    "location": "Cleveland, OH",
    "application_url": "https://jobot.com/apply/cctv-access-control-installer-regional-travel/1731371799?utm_source=LinkedIn",
    "keywords": [
      "CCTV",
      "Access Control",
      "Installer",
      "Regional Travel",
      "Low Voltage",
      "Video Surveillance",
      "Alarm Systems",
      "Electronic Security",
      "Digital Video Recorders",
      "Installation",
      "Training",
      "Background Check",
      "DMP",
      "Lenel",
      "Bosch",
      "Honeywell",
      "Verint",
      "March Networks",
      "Hanwha",
      "Self Starter"
    ]
  },
  {
    "title": "Java Architect",
    "description": "Who are we?First Derivatives (FD) is a leading software and services company, with world-leading intellectual property in ultra-high-performance analytics (KX) across industries, and extensive domain expertise and capabilities in capital markets systems and technology (managed services and consulting).\nJava Architect:\n· 15+ years of strong proficiency in OOPS concepts with JAVA and knowledge of RESTful APIs Architecture.· Min. 8 years of experience with Spring Boot, Spring Security, Spring Data, Spring MVC along with Unit Testing, Integration Testing and BDD Testing.· RDBMS knowledge and/or exposure to MS SQL server database.· Authoring of technical documentation that communicates in a clear and detailed fashion the proposed technical solution.· Experience in Performance Analysis and applications tuning.· Excellent understanding of design patterns and microservice architecture.· Hands on experience in Enterprise Integration Patterns (EIP); Exposure with Apache camel or spring integration is considered a plus.· Hands on experience with Kubernetes and exposure in no-SQL databases is considered a plus.\nKX technology is designed to capture and analyze data to make real-time decisions in a world where data volumes generated by markets and machines are increasing exponentially, and existing technologies fail due to technological or commercial limitations.\nKX is widely adopted throughout the financial industry, and is poised for accelerated growth across high-tech manufacturing, automotive, oil and gas, utilities and telecommunications.\nManaged Services and ConsultingFD provides a range of services worldwide to its clients in the capital markets sector, including many of the world’s leading banks, focused on supporting mission-critical systems as well as helping them to achieve and maintain regulatory compliance.\nFD provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.",
    "location": "Pennsylvania, United States",
    "application_url": null,
    "keywords": [
      "Java",
      "Architect",
      "OOPS",
      "RESTful APIs",
      "Spring Boot",
      "Spring Security",
      "Spring Data",
      "Spring MVC",
      "Unit Testing",
      "Integration Testing",
      "BDD Testing",
      "RDBMS",
      "MS SQL Server",
      "Performance Analysis",
      "Design Patterns",
      "Microservice Architecture",
      "Enterprise Integration Patterns",
      "Kubernetes",
      "NoSQL",
      "Financial Industry"
    ]
  },
  {
    "title": "Laboratory Operations (LabOps) Project Manager",
    "description": "Job Description\n\nTarget PR Range: 62-72/hr\n\nDepending on experience\n\nLaboratory Operations (LabOps) Project Manager\n\nThe LabOps Project Manager will oversee projects pertaining to the purchase, installation, and qualification of new analytical instrumentation, equipment, and software. This individual will work with project teams consisting of cross-functional team members from metrology, validation, quality control, analytical, quality assurance, and facilities operations to ensure efficient completion of these laboratory-based projects. Additional projects may also include process-improvements related to lab functions.\n\nJob Responsibilities\n\nManage laboratory operations projects: including the installation of new analytical instruments and equipment, new software, relocations, and process improvements Work closely with Quality Control (QC) and Analytical Development and Operations (ADO) personnel to determine laboratory needs and user requirements Ensure timely procurement of purchases by obtaining and reviewing quotes, facilitating WOs and POs, and following-up on shipping & delivery status Facilitate the demonstration of new laboratory systems as needed Team-up with Facilities Operations in site planning and preparation for instrument installations, including site assessments and communicating engineering/utility requirements Collaborate with validation team members during qualification activities for GMP systems Review documents pertaining to system implementations, including installation requirements, protocols, procedures, work instructions, and guidelines Produce critical project documentation, including timelines in Microsoft Project, project charters, WBS, Teams communications, status update e-mails, PowerPoint presentations, lessons learned, etc. Communicate project requirements, goals, and timelines effectively via weekly project and team meetings Assist in key project decision making efforts Present project summaries and status updates to large groups through PowerPoint and verbal communication Organize meetings with vendors and the Vendor Service Team as needed Apply knowledge of current Good Manufacturing Practices (cGMPs) concepts when applicable \nThe Planet Group of Companies is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.\n",
    "location": "San Mateo, CA",
    "application_url": "https://careers.planet-pharma.com/Laboratory-Operations-LabOps-Project-Manager-Jobs-in-San-Mateo-CA/11060318",
    "keywords": [
      "LabOps",
      "Project Manager",
      "analytical instrumentation",
      "equipment installation",
      "qualification",
      "cross-functional teams",
      "metrology",
      "validation",
      "quality control",
      "analytical development",
      "quality assurance",
      "facilities operations",
      "process improvements",
      "GMP",
      "cGMP",
      "procurement",
      "Microsoft Project",
      "vendor management",
      "project documentation"
    ]
  },
  {
    "title": "Commissioned Sales Associate (Palm Beach)",
    "description": "Job title: Commissioned Sales Associate (Palm Beach)\n\nContract type:\n\nLocation: Palm Beach\n\nDiscipline:\n\nRemote: No\n\nSalary: $22/hr\n\nReference: 463923\n\nContact name: Avery Henry\n\nJob Description\n\nClient Overview:\n\nOur client is a leading retail brand, popular among consumers of all ages. With locations all over the country they pride themselves on creating an exceptional in-store experience.\n\nSales Associate Overview:\n\nAs a retail Sales Associate, you will provide outstanding customer service and demonstrate superior product knowledge to customers. You will create an in-store shopping experience that makes the customer feel welcome and comfortable and ensure merchandise is always displayed correctly and well-stocked.\n\nSales Associate Responsibilities:\n\n\n Provide exceptional customer experience by ensuring the customer is always the top priority Promptly and politely respond to customer inquiries and requests for support Engage customers to determine their needs and direct them to the appropriate merchandise while providing product knowledge Meet set sales targets and manage clientele process Assist the team in executing all daily retail operations to ensure premium service and smooth store functioning Organize and straighten merchandise areas on the sales floor Frequent use of technology to perform job functions, including handheld equipment, cash register, and ability to process register transactions\n\n\nSales Associate Key Qualifications:\n\n\n Must be at least 18 years of age 1 or more years of customer service and/or retail experience preferred Strong interpersonal skills with proven ability to communicate and share information with diverse groups of customers and colleagues. Proficient in POS systems a plus Ability to work a flexible schedule with retail hours, including day, evening, weekends, and holidays\n\n\nSales Associate Physical Requirements:\n\n\n Prolonged period of standing/walking around the retail store Bend, lift, open, and move products up to 25 pounds as needed\n\n\nLocation: Palm Beach, FL\n\nPay: $22/hr + commission\n\nPosition Type: Temporary, 3 months (could be longer)",
    "location": "Palm Beach, FL",
    "application_url": "https://www.24seventalent.com/job/commissioned-sales-associate-palm-beach",
    "keywords": [
      "commissioned sales",
      "retail",
      "customer service",
      "customer experience",
      "product knowledge",
      "sales targets",
      "merchandise",
      "POS systems",
      "flexible schedule",
      "Palm Beach",
      "standing",
      "walking",
      "lifting",
      "interpersonal skills",
      "technology",
      "cash register",
      "team collaboration",
      "temporary position",
      "$22/hr"
    ]
  },
  {
    "title": "Research Intern, Organizational Research and Consulting",
    "description": "WHO WE ARE: At Fors Marsh, we take on issues that matter. We are a team of researchers, advisors, and communicators working together to shape the systems that shape our lives. We look at human behavior from all angles to design targeted solutions that influence decision-making and move people to action. We are committed to the problem, not just the project, and we are intentional about taking on work and forming partnerships that balance purpose, people, planet, and profit. We are a certified B Corporation, a Just employer, and a 2019-2024 Top Workplace. We hold ourselves accountable to the values that have always defined us. And those values drive us to be the best possible versions of ourselves-for each other, our communities, our clients, and the world.\n\nWHO WE ARE LOOKING FOR: Fors Marsh’s Human Capital and Business Advisory Services (HCBAS) practice is seeking a highly organized, experienced, intelligent, and motivated Research Intern to join our Organizational Research and Consulting (ORC) Division. This job is best suited for those who have completed or are currently in progress of completing an advanced degree program with a background in industrial-organizational psychology, social psychology, organizational behavior, business or related discipline to contribute to research and consulting projects across a variety of government contracts. You will contribute to the execution, interpretation, and reporting of research and consulting studies employing a variety of quantitative and qualitative methodologies. The ideal candidate continuously strives to learn and develop and enjoys working in a highly collaborative environment.\n\nResponsibilities include:\n\nNote-taking for interviews, focus groups, or meetings.Contributing to literature reviews.Assisting with qualitative data analysis.Assisting with quantitative data analysis.Assisting in preparing research reports, briefs, presentation decks, and other external communications.Updating administrative or project-related documents (e.g., participant trackers, task schedules).\n\nQualifications:\n\nCompleted or currently in progress of completing an advanced degree program (e.g., MA, MS, PhD) in social/behavioral science, business and administration, or other related technical or liberal arts field.Interest in applied research, with an ability to think creatively to solve tangible organizational behavior problems through research.Exceptional attention to detail.Highly self-motivated.Desire and ability to be a team player.Basic understanding of qualitative and quantitative research methods.Strong verbal and written communications skills.Experience in Microsoft PowerPoint, Word, and Excel.Must be a U.S. Citizen and consent to a full background check due to our federal contract requirements.\n\nPreferred qualifications:\n\nExperience in using statistical software packages (e.g., SPSS, Stata).Experience in writing research reports for technical and non-technical audiences.Experience in writing research proposals or grant writing.\n\nWe Offer:\n\nOur benefits typically meet or exceed our competitors’ packages. Ways we are unique?\n\nAbility to make an impact on people’s lives, both internal and external to the organization.Top-tier health, dental, vision, and long and short-term disability coverage all covered at 100% for employee coverage.Remote work.Our company culture, which values balance and allows each employee to take leave as they require it to balance the responsibilities of both their work and home lives without worrying about depleting their available leave hours.We provide a floating holiday bank so you can celebrate the days you value.Generous matching retirement contributions and no vesting period starting the third month of employment.Dedicated training and development budgets to expand your expertise and grow your skillset.You can volunteer your way with paid time off.You can participate in Fors Marsh staff-led affinity groups.Our employees receive product and service discounts through the certified B Corp network.\n\nCompensation: \n\n Working towards Master's degree: $25-$29/hour. Master's degree: $30/hour. Working towards PhD: $30-$35/hour. \n\nInternship length: 3 months.\n\nHourly commitment: 30 hours/week.\n\nLocation: Remote, United States Residents only.\n\nEOE: All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.",
    "location": "Arlington, VA",
    "application_url": "https://fors-marsh-group.breezy.hr/p/439db35b2068-research-intern-organizational-research-and-consulting/apply?source=linkedin",
    "keywords": [
      "research",
      "organizational",
      "consulting",
      "intern",
      "qualitative",
      "quantitative",
      "data analysis",
      "advanced degree",
      "social psychology",
      "industrial psychology",
      "organizational behavior",
      "Microsoft Office",
      "statistical software",
      "literature reviews",
      "interviews",
      "focus groups",
      "U.S. citizen",
      "background check",
      "remote work",
      "technical writing"
    ]
  },
  {
    "title": "Staff Accountant to $55K with company paid child care and 4 weeks vacation!",
    "description": "Newly created Staff Accountant role with a stable, growing firm. \nThe firm offers incredible benefits including:12 paid holidays4 weeks of vacation per year75% of healthcare and dental paid by the companyChildcareAbility to work hybrid with 2 day/week at home once up to speedExceptional quality of life\nDUTIES AND RESPONSIBILITIES: Prepare, pay, file all accounts payable. Research and resolve discrepancies. Prepare and enter daily and monthly general ledger transactions. Analyze and prepare reconciliations for various accounts as assigned. Maintain knowledge and compliance with the company's policies and procedures. Perform wire transfer services - initiation or verification. Review and balance daily branch cash accounts. Research and resolve discrepancies. Review and balance daily totals for loans, shares, and certificates of deposit between the general ledger and the operating system. Research and resolve discrepancies. Review and balance daily totals for the credit card portfolios between the general ledger and credit card processor reports. Research and resolve discrepancies. Prepare daily cash position analysis report. Prepare, post, and balance daily ACH transaction downloads. Research and resolve discrepancies. Prepare or assist with the preparation of the month-end financial statement packages including consolidated and unconsolidated financial statements. Assist in audits of the firm’s records by examiners and the external CPA firm. Provide support to other employees, and other management as necessary.\nPERSONAL REQUIREMENTS: Ability to effectively meet and deal with people BS in Accounting, Finance, General Business OR strong work experience Detail oriented and able to meet deadlines Knowledge of Excel spreadsheets",
    "location": "Peachtree Corners, GA",
    "application_url": null,
    "keywords": [
      "Staff Accountant",
      "accounts payable",
      "general ledger",
      "reconciliations",
      "financial statements",
      "Excel",
      "BS Accounting",
      "Finance",
      "wire transfers",
      "ACH transactions",
      "month-end",
      "audits",
      "cash position",
      "discrepancies",
      "compliance",
      "detail oriented",
      "deadlines",
      "banking operations",
      "credit card processing",
      "CPA"
    ]
  },
  {
    "title": "Radiologic Technologist",
    "description": "Job Title: Radiologic TechnologistLocation: Cumming, GAPay rate: $2125/Week\nJob Summary: The Radiologic Technologist performs diagnostic imaging procedures using X-rays and other imaging modalities to assist in the diagnosis and treatment of patients. The role requires technical proficiency, attention to detail, and a commitment to patient care and safety.\nKey Responsibilities:Perform diagnostic imaging procedures, including X-rays, CT scans, MRI scans, and fluoroscopies, according to physician orders.Position patients correctly and operate imaging equipment to obtain high-quality images.Monitor patients during procedures to ensure their safety and comfort.Review and evaluate images for quality and clarity, ensuring all necessary anatomical structures are visible.Collaborate with radiologists and other healthcare professionals to interpret images and assist in patient diagnosis and treatment planning.Maintain accurate patient records, documenting procedures, patient information, and radiation dosages.Follow established protocols and safety measures to minimize radiation exposure to patients, staff, and self.Perform routine maintenance and quality control checks on imaging equipment to ensure optimal performance.Stay updated on advancements in radiologic technology and participate in continuing education and training programs.Adhere to regulatory standards, policies, and procedures related to radiology practices and patient care.\nQualifications:Associate's degree in Radiologic Technology or a related field; Bachelor's degree preferred.Valid state licensure or certification as a Radiologic Technologist.CPR certification.Strong technical skills and proficiency in operating radiologic equipment.Excellent communication and interpersonal skills.Ability to work effectively in a fast-paced environment and handle stressful situations with calmness and professionalism.Commitment to patient confidentiality and ethical conduct.\nPhysical Requirements:Ability to stand for long periods and lift/move patients as needed.Manual dexterity to operate imaging equipment and accessories.Visual acuity to interpret images and identify potential abnormalities.\nWork Environment:Hospital radiology departmentsOutpatient imaging centersPhysician officesEmergency roomsMay require working evenings, weekends, or on-call shifts based on facility needs.",
    "location": "Cumming, GA",
    "application_url": null,
    "keywords": [
      "Radiologic Technologist",
      "diagnostic imaging",
      "X-rays",
      "CT scans",
      "MRI scans",
      "fluoroscopies",
      "imaging equipment",
      "patient positioning",
      "radiation safety",
      "quality control",
      "Associate's degree",
      "state licensure",
      "certification",
      "CPR",
      "technical skills",
      "patient care",
      "radiologists",
      "healthcare professionals",
      "imaging procedures",
      "medical imaging"
    ]
  },
  {
    "title": "Application Coordinator",
    "description": "Akkodis is seeking an Application Penetration Coordinator role in Tampa, FL or Dallas, TX (Hybrid) for a Contract position with a client located in Tampa, FL or Dallas, TX (Hybrid).\nPay Range: $50-52/hour W2  Location: Tampa, FL or Dallas, TX (Hybrid).).\nResponsibilities:\nManage App Pentest Scope containing applications to be tested in-compliance with App Pentest Policy & Control StandardsManage Annual App Pentest Review ScheduleManage App Pentest scoping questionnaire and create application assessments in AppSec vulnerability management system.Keep track of remediation of App Pentest vulnerability reported, Policy Deviations, GRC Issues and Risk AcceptancesCoordinate meetings to facilitate App Pentest reviews.Respond to regulatory requests & client questionnaire team by providing App Pentest artifacts.\nQualification:\nDemonstrates reliability by taking necessary actions to continuously meet required deadlines and goals.Global Collaboration: Applies global perspective when working within a team by being aware of own style and ensuring all relevant parties are involved in key team tasks and decisions.Communication: Articulates information clearly and presents information effectively and confidently when working with others.Influencing: Convinces others by making a strong case, bringing others along to their viewpoint; maintains strong, trusting relationships while at the same time is comfortable challenging ideas.Innovation and Creativity: Thinks boldly and out of the box, generates new ideas and processes, and confidently pursues challenges as new avenues of opportunity.3 to 5 years of experience as a project manager/coordinator.Bachelor's degree is desirable.Excellent communication, coordination, and organizational skills.\nIf you are interested in this Application Penetration Coordinator role in Tampa, FL or Dallas, TX (Hybrid) job then please click APPLY NOW. For other opportunities available at Akkodis go to www.akkodis.com.If you have questions about the position, please contact Rahul Singh at 610-813-1156 or rahul.singh@akkodisgroup.com\nEqual Opportunity Employer/Veterans/Disabled  Benefit offerings include medical, dental, vision, term life insurance, short-term disability insurance, additional voluntary benefits, commuter benefits and 401K plan. Our program provides employees the flexibility to choose the type of coverage that meets their individual needs. Available paid leave may include Paid Sick Leave, where required by law; any other paid leave required by Federal, State or local law; and Holiday pay upon meeting eligibility criteria. \nTo read our Candidate Privacy Information Statement, which explains how we will use your information, please visit https://www.akkodisgroup.com/en-us/candidate-privacy/\nThe Company will consider qualified applicants with arrest and conviction records.",
    "location": "Dallas, TX",
    "application_url": null,
    "keywords": [
      "Application Coordinator",
      "Penetration Testing",
      "App Pentest",
      "Vulnerability Management",
      "Project Manager",
      "Coordinator",
      "Security Testing",
      "Compliance",
      "Policy Standards",
      "Risk Management",
      "GRC",
      "Remediation",
      "AppSec",
      "Regulatory Requests",
      "Communication",
      "Organizational Skills",
      "Bachelor's Degree",
      "Hybrid",
      "Tampa FL",
      "Dallas TX"
    ]
  },
  {
    "title": "Part-Time Bookkeeper (10 hours/week)",
    "description": "Job Description\n\nOverview:**\n\nThe ideal candidate will have expertise in accounting principles and practices!\n\nDuties:** Quartely Taxes, Unemployment taxes, sales tax reports Perform general ledger reconciliationWeek payroll reporting Utilize technical accounting skills to maintain accurate financial records Familiarity with Governmental accounting practices Ensure compliance with accounting standards and regulationsQualifications:** Proven experience as a Bookkeeper or in a similar role Proficiency in QuickBooks Strong knowledge of accounting practices, including account reconciliation Ability to handle sensitive financial information with confidentiality Excellent organizational skills and attention to detail",
    "location": "Farragut, TN",
    "application_url": "https://www.ziprecruiter.com/jobs/staffsource-bf03166f/part-time-bookkeeper-10-hours-week-af2ccc02?tsid=122001595&enc_campaign_id=d1804fea",
    "keywords": [
      "Bookkeeper",
      "QuickBooks",
      "accounting principles",
      "general ledger reconciliation",
      "payroll reporting",
      "quarterly taxes",
      "sales tax reports",
      "unemployment taxes",
      "account reconciliation",
      "financial records",
      "governmental accounting",
      "compliance",
      "accounting standards",
      "confidentiality",
      "organizational skills",
      "attention to detail",
      "part-time",
      "10 hours per week"
    ]
  },
  {
    "title": "Airport Ramp Agent- F9",
    "description": "Job Summary\n\nRamp agents are responsible for loading and unloading aircraft baggage, guiding planes to and from their gates, operating baggage carts, de-icing planes and performing other airplane servicing duties. Ramp agents have fast-paced careers and should be comfortable working in any weather, including rain, snow, and heat. The ideal candidate is capable of working in stressful situations, under rigid time constraints, and potentially interacting with customers.\n\nResponsibilities For Ramp Agent\n\nSafely lift, load, unload and transport baggage, mail, and cargo from aircraft to airportMaintain on-time connections by guiding aircraft to and from gate positionsProtect baggage and other equipment from damage, loss and weather conditionsDrive and operate ground equipment, such as tugs, cargo carts, service trucks, and belt loadersAssist with record-keeping and documentation to ensure correct routing of baggageAdhere to safety guidelines and maintain safe working conditions for yourself and othersCommunicate with managers and lead agents to manage daily schedulesReport equipment problems and breakdowns to facilitate fast repairs\n\nRequirements\n\nMust be at least 18 years of ageAble to work in extreme conditions, such as hot and cold weather, as well as small spacesHigh school diploma or equivalent, such as successful completion of a GEDFamiliarity with basic computer programs to assist with record-keeping and baggage routingPossess a valid driver's license and have a good driving recordPass a physical agility test, depending on the airlineStrong teamwork and collaboration skills to help achieve team goalsExcellent verbal and written communication skills, such as email and phoneFlexible schedule allowing work during nights, weekends and holidaysAdaptability to changing priorities and time management skills\n\nGAT Airline Ground Support, as an equal opportunity employer, makes hiring decisions based on business needs and the best-qualified candidates available and does not discriminate in its employment decisions on the basis of any protected category.GAT Airline Ground Support is a drug-free workplace and conducts a random drug test.Employment with GAT Airline Ground Support is contingent upon a clear driving record, 10-year criminal History records check, and drug screen as required. You must also have proof of high school or GED completion.\n\nApply Now",
    "location": "Kenner, LA",
    "application_url": "https://us232.dayforcehcm.com/CandidatePortal/en-US/wearegat/site/candidateportal/Posting/View/10441",
    "keywords": [
      "Airport",
      "Ramp Agent",
      "baggage",
      "aircraft",
      "loading",
      "unloading",
      "ground equipment",
      "safety",
      "weather conditions",
      "teamwork",
      "communication",
      "driver's license",
      "physical agility",
      "flexible schedule",
      "de-icing",
      "cargo",
      "transportation",
      "gate operations",
      "record-keeping",
      "drug-free workplace"
    ]
  },
  {
    "title": "Integrated Absence Claims Specialist",
    "description": "Alternate Locations: Phoenix, AZ (Arizona); US Midwest; US Southwest; US West; Work from Home\n\n Work Arrangement:\n\nHybrid/Flexible : Work at home and use the office as appropriate for in-person collaboration.\n\nRelocation assistance:  is not available for this opportunity.\n\nRequisition #: 72879\n\nThe Role at a Glance\n\nWe are excited to bring on a highly motivated Integrated Absence Claims Specialist to staff our ever-growing claims organization.\n\nAs an Integrated Absence Claims Specialist, you will manage a workload of Short-Term Disability claims and their associated leaves. You will be responsible for conducting initial and ongoing interviews with claimants, obtaining, and reviewing medical records and making timely and ethical claim determinations. You’ll complete a thorough training to develop new skills and give you the confidence you need to be successful in your new role. If you enjoy working in a fast-paced team environment from the comfort of your own home, then please read on!\n\nLearn more about a Day in the Life of a Claims Specialist at Lincoln Financial Group!\n\nWhat You'll Be Doing\n\nCommunicating with claimants, employers and various medical professionals through phone and e-mail to gather information regarding Short Term Disability Claims, Family Medical Leaves, and state benefits when applicable. Collaborating with fellow case managers, nurse case managers and consulting physicians to make appropriate and timely claim determinations. Reviewing complex medical records and effectively leveraging a variety of tools and resources to understand appropriate approval durations and future action planning Completing accurate financial calculations consistent with company and state guidelines. Providing exceptional customer service and proactively recognizing customer needs and areas of opportunity.\n\nWhat We’re Looking For\n\nMust haves:\n\nHigh School diploma or GED\n\n1-2 years of experience in claims, leaves, or customer service Strong written and verbal communication skills Excellent organization skills with the ability to multi-task \n\nNice to haves:\n\nExperience with disability and/or absence management Strong mathematical skills for payment calculations\n\nWhat’s it like to work here?\n\nAt Lincoln Financial Group, we love what we do. We make meaningful contributions each and every day to empower our customers to take charge of their lives. Working alongside dedicated and talented colleagues, we build fulfilling careers and stronger communities through a company that values our unique perspectives, insights and contributions and invests in programs that empower each of us to take charge of our own future.\n\nWhat’s in it for YOU:\n\nA clearly defined career framework to help you successfully manage your careerLeadership development and virtual training opportunitiesPTO/parental leaveCompetitive 401K and employee benefitsFree financial counseling, health coaching and employee assistance programTuition assistance programA leadership team that prioritizes your health and well-being; offering a remote work environment and flexible work hybrid situationsEffective productivity/technology tools and training\n\nPay Range: $25.69 - $32.45\n\nActual base pay could vary based on non-discriminatory factors including but not limited to work experience, education, location, licensure requirements, proficiency and qualifications required for the role. The base pay is just one component of Lincoln’s total rewards package for employees. In addition, the role may be eligible for the Annual Incentive Program, which is discretionary and based on the performance of the company, business unit and individual. Other rewards may include long-term incentives, sales incentives and Lincoln’s standard benefits package.\n\nAbout The Company\n\nLincoln Financial Group helps people to plan, protect and retire with confidence. As of Dec. 31, 2023, approximately 17 million customers trust our guidance and solutions across four core businesses – annuities, life insurance, group protection and retirement plan services. As of December 31, 2023, the company had $295 billion in end-of-period account balances, net of reinsurance. Headquartered in Radnor, Pa., Lincoln Financial Group is the marketing name for Lincoln National Corporation (NYSE: LNC) and its affiliates. Learn more at LincolnFinancial.com.\n\nLincoln is committed to creating a diverse and inclusive environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.\n\nFollow us on Facebook, X, LinkedIn, and Instagram. For the latest company news, visit our newsroom.\n\nBe Aware of Fraudulent Recruiting Activities\n\nIf you are interested in a career at Lincoln, we encourage you to review our current openings and apply on our website. Lincoln values the privacy and security of every applicant and urges all applicants to diligently protect their sensitive personal information from scams targeting job seekers. These scams can take many forms including fake employment applications, bogus interviews and falsified offer letters.\n\nLincoln will not ask applicants to provide their social security numbers, date of birth, bank account information or other sensitive information in job applications. Additionally, our recruiters do not communicate with applicants through free e-mail accounts (Gmail, Yahoo, Hotmail) or conduct interviews utilizing video chat rooms. We will never ask applicants to provide payment during the hiring process or extend an offer without conducting a phone, live video or in-person interview. Please contact Lincoln's fraud team at fraudhotline@lfg.com if you encounter a recruiter or see a job opportunity that seems suspicious.\n\nAdditional Information\n\nThis position may be subject to Lincoln’s Political Contribution Policy. An offer of employment may be contingent upon disclosing to Lincoln the details of certain political contributions. Lincoln may decline to extend an offer or terminate employment for this role if it determines political contributions made could have an adverse impact on Lincoln’s current or future business interests, misrepresentations were made, or for failure to fully disclose applicable political contributions and or fundraising activities.\n\nAny unsolicited resumes/candidate profiles submitted through our web site or to personal e-mail accounts of employees of Lincoln Financial Group are considered property of Lincoln Financial Group and are not subject to payment of agency fees.\n\nLincoln Financial Group (“LFG”) is an Equal Opportunity employer and, as such, is committed in policy and practice to recruit, hire, compensate, train and promote, in all job classifications, without regard to race, color, religion, sex (including pregnancy), age, national origin, disability, sexual orientation, gender identity and expression, Veteran status, or genetic information. Applicants are evaluated on the basis of job qualifications. If you are a person with a disability that impedes your ability to express your interest for a position through our online application process, or require TTY/TDD assistance, contact us by calling 260-455-2558.\n\nThis Employer Participates in E-Verify. See the E-Verify notices.\n\nEste Empleador Participa en E-Verify. Ver el E-Verify avisos.",
    "location": "Phoenix, AZ",
    "application_url": "https://jobs.lincolnfinancial.com/job/Phoenix-Integrated-Absence-Claims-Specialist-AZ-85001/1139370200/?feedId=175800&utm_source=LinkedInJobPostings&utm_campaign=LFG_LinkedIn",
    "keywords": [
      "Short-Term Disability",
      "claims management",
      "medical records",
      "customer service",
      "communication skills",
      "FMLA",
      "Family Medical Leave",
      "disability benefits",
      "absence management",
      "claim determinations",
      "case management",
      "insurance claims",
      "written communication",
      "verbal communication",
      "organization skills",
      "multi-task",
      "mathematical skills",
      "payment calculations",
      "hybrid work"
    ]
  },
  {
    "title": "VP, Strategy & Insights",
    "description": "What to knowWe’re looking for a seasoned leader with a record of success in developing the strategy that underpins brand engagement programs, supporter experience, and creative development. You’ll uncover rich audience insights, develop frameworks, and craft strategies that help solve the world’s biggest challenges and drive positive progress in society, working across a diverse range of clients and topics. From leading the research and strategy development for a new climate change campaign, to getting involved in rapid ideation about how to respond to a humanitarian emergency, to helping brands formulate strategies and bring insights to their efforts to be more purpose-led, the work of a strategy lead at Blue State is diverse, stimulating and impactful.\nYou’ll be a critical leadership voice on a team of multi-disciplinary colleagues including creative directors, communications strategists, analysts, technologists, and account directors.We’re looking for an analytical and collaborative individual who can inspire, mentor, and train people across the agency and evolve our Strategy practice. You’ll work closely with senior business leads to grow our client portfolio and strengthen our existing partnerships.To see some of our work in practice, check out our work with Amnesty International, ONE.org, Ford, Oxfam International, and ProsperUS.\nThe companyBlue State is a purpose-driven agency. We partner with leading causes, brands, and campaigns and create real change. From Google and UNICEF to Amnesty International and Oxfam, we transform how brands and causes raise money, influence policy, build platforms, and grow communities of supporters. Led by the most creative and analytical minds from the political, nonprofit, and brand worlds, Blue State is a part of WPP Digital and has 150+ employees in the US and London.\nA day in the lifeOur briefs are always different and that makes the work interesting and exciting. But you can expect the role to involve a mix of the following:Leading research, discovery, and insight development processes that drive decisions around creative, messaging, and campaign design.Partnering with business development, account, and creative teams to determine the right research methodology and strategic approach to a given client challenge and working collaboratively with other internal or external teams to make sure together we produce strategies and recommendations informed by data and research.Conducting or supporting the team with primary research (interviews, surveys, focus groups, creative testing) as well as secondary (desk research, landscape and trend analysis, using audience intelligence tools, social listening).Translating the findings into insights that are both inspiring and actionable, including a core strategic proposition, audience definition and prioritization, and clearly articulated objectives and KPIs.Overseeing or delivering traditional business and marketing frameworks like SWOTs, personas, user journeys, gap analyses, landscape research, creative briefs, etc.Identifying trends and opportunities to innovate our research methodologies to meet emerging needs, experimenting with new approaches or tools to push our insights practice forward, and training other team members.Facilitating and participating in brainstorming sessions, client presentations, workshops and overall project delivery.Growing and manage client portfolio through regular account planning activities, and creating client roadmaps over months and years where appropriate.Crafting and pitching new business as well as representing Blue State via event participation and other thought leadership.Mentoring and upskilling team members.\nThe teamGood strategy is about taking the best possible journey to your ultimate destination and our Strategy Team is focused on plotting that course for our clients. As a part of the Strategy team, you’ll work closely with a cross-disciplinary group of Blue State employees who are passionate, geeky, and care about their clients and causes. We are a group of strategists that come from a wide range of backgrounds that collaborate to learn from the different approaches and contexts that can make our work better.\nWe love to understand what makes people tick, what the events of the day impact how people feel, and ultimately, what’s the perfect insight that would mobilize someone to take an action that moves us toward progress. You’ll have the opportunity to work with some of the most inspiring charities, ambitious brands, and passionate advocacy and social change campaigns.\nWhat we offerUnlimited time-off (inclusive of sick, personal, and vacation days)$1,000 annually in professional development fundsCompetitive health, dental, and vision insuranceInclusive family planning coverage, including fertility, surrogacy, and adoption benefitsFlexible and health savings accounts401K & employer matchGenerous paid holiday schedule12-week fully-paid parental leave for all parents-to-beShort-term and long-term disability insurancePre-tax commuter benefitsRemote work flexibility\nWe approach in-office working with a hybrid model. On-site presence is welcome for US staff who are within commuting distance of the NY or DC office. Managers retain discretion to require in-person attendance for folks on their discipline or client teams as necessary, including for those whose roles require them to be in person. To enter our US offices or attend Blue State events, staff and visitors must be fully vaccinated against COVID-19, including with a booster shot when eligible. Exceptions for protected grounds will be reviewed on a case-by-case basis.\nThe salary range for this position is $140,000-$160,000; compensation will be commensurate with experience.\nSome things we're looking forYou have 12+ years of relevant experience in a relevant role. You are not a lone wolf. You genuinely enjoy bringing others along in the process of the work. You have command of a room and superb presentation skills. You have the ability to build trust and confidence in early interactions with stakeholders at the highest level, and you understand the art of how to sell great ideas and great work. You have a mix of qualitative and quantitative research experience, using both primary and secondary methods. Bonus if you have familiarity with social psychology, cognitive science and/or behavioral economics frameworks and principles.You have experience utilizing social listening tools like Brandwatch and Audiense, and syndicated survey tools like GWI.You’re a thinker and a doer. You’re happy to roll your sleeves and spend time conducting interviews, focus groups or using audience intelligence tools, as well as championing the findings and building strategic recommendations around them.You have a curious and proactive mind. You like to use substantiated data to both identify and solve problems, with an eye for spotting new opportunities for how research and strategy can make projects stronger. You enjoy designing the right research methodology, be it via audience surveys, focus groups, social listening or desk research, while also switching seamlessly to writing an insightful creative brief. You’re an experienced facilitator, managing ideation sessions and workshops with clients or colleagues in person and virtually.You’re resilient and able to adapt to new situations, solve problems on the fly, and communicate with those around you. Teamwork and scrappiness are required, with an agile approach to projects that may change course regularly based on results and the external environment requiring a pivot.You have a shared passion and curiosity for making change – and a commitment to quality that ensures we’re always making progress.You are steeped in the art of empathy, practice mutual respect, and will act as a role model at Blue State. A commitment to Diversity, Equity, and Inclusion is vital.\n\nAt Blue State, diversity is a necessity, not a nice-to-have. We encourage those from underrepresented communities — women, people of color, LGBTQIA+, immigrants, those with disabilities and people at all the intersections in between — to apply. Even if you don’t think your current skill set checks every box, but this role seems to align with your strengths, we want to hear from you.\nBlue State is committed to creating an inclusive and accessible application and interview process. If you would like to request a reasonable accommodation for a disability, please contact us at recruiting@bluestate.co with the subject line: Accommodation Request to get started.\nYour privacy is important to us. You can find out more information on how we handle your data for recruiting purposes in our Privacy Policy for Recruitment.",
    "location": "New York City Metropolitan Area",
    "application_url": null,
    "keywords": [
      "VP",
      "Strategy",
      "Insights",
      "brand engagement",
      "audience insights",
      "research",
      "campaign strategy",
      "creative development",
      "analytical",
      "leadership",
      "mentoring",
      "qualitative research",
      "quantitative research",
      "social listening",
      "strategic planning",
      "client management",
      "presentation skills",
      "collaboration",
      "purpose-driven",
      "behavioral economics"
    ]
  },
  {
    "title": "RN Wound Specialist - Home Health",
    "description": "Description\n\nRN Wound Specialist - Providence Home Health in King County, WA.\n\n$10,000 Hiring Bonus for eligible external candidates who meet all conditions for payment\n\nSchedule: Monday-Friday, 8am-4:30pm\n\nService Area: East King County\n\nJob Description\n\nThe Registered Nurse Wound Specialist is responsible for providing evaluation, nursing services, consultation and education for staff regarding wound care. Functions independently and/or in conjunction with an interdisciplinary team based on the patient's identified needs. Practice is within the scope defined by the Washington State Nurse Discipline Practice Act, based on the nursing process model and concept of community health nursing therapy.\n\nWorking in Home Health provides the unique opportunity to care for your patients where they are most comfortable. Join our team to create rewarding relationships with a diverse patient population while exercising independence and flexibility with your career.\n\nBenefits And Perks\n\nCompetitive pay (including holiday pay & shift pay differentials)Best-in-class benefits – full medical, dental and vision coverage from your first day401(k) plan with employer matching & complementary retirement plannerGenerous paid time off for vacation, sick days and holidaysMileage reimbursement for roles traveling to patient homesTuition reimbursement & student loan forgiveness programsWellness & mental health assistance programsBack-up child & elder care to help with care disruptions for your familyVoluntary benefits, like pet, auto and home insurance, and more!\n\nRequired Qualifications\n\nGraduation from an accredited nursing program.Washington Registered Nurse License upon hire.National Provider BLS - American Heart Association upon hire.1 year Nursing experience.\n\nPreferred Qualifications\n\nCurrent WOCN license upon hire, OrLicensed as Wound Care Specialist or Enterostomal Therapist upon hire.\n\nWhy Join Providence?\n\nOur best-in-class benefits are uniquely designed to support you and your family in staying well, growing professionally, and achieving financial security. We take care of you, so you can focus on delivering our Mission of caring for everyone, especially the most vulnerable in our communities.\n\nAccepting a new position at another facility that is part of the Providence family of organizations may change your current benefits. Changes in benefits, including paid time-off, happen for various reasons. These reasons can include changes of Legal Employer, FTE, Union, location, time-off plan policies, availability of health and welfare benefit plan offerings, and other various reasons.\n\nAbout Providence\n\nAt Providence, our strength lies in Our Promise of “Know me, care for me, ease my way.” Working at our family of organizations means that regardless of your role, we’ll walk alongside you in your career, supporting you so you can support others. We provide best-in-class benefits and we foster an inclusive workplace where diversity is valued, and everyone is essential, heard and respected. Together, our 120,000 caregivers (all employees) serve in over 50 hospitals, over 1,000 clinics and a full range of health and social services across Alaska, California, Montana, New Mexico, Oregon, Texas and Washington. As a comprehensive health care organization, we are serving more people, advancing best practices and continuing our more than 100-year tradition of serving the poor and vulnerable.\n\nThe amounts listed are the base pay range; additional compensation may be available for this role, such as shift differentials, standby/on-call, overtime, premiums, extra shift incentives, or bonus opportunities.\n\nCheck out our benefits page for more information about our Benefits and Rewards.\n\nAbout The Team\n\nProvidence Home and Community Care (HCC) is a service line within Providence with over 8,000 caregivers and 2,000 volunteers serving nearly 200,000 people a year, in their homes, in clinics and in a variety of congregate living ministries across our seven-state footprint.\n\nHCC provides a full range of services and support for people of all ages, especially those facing chronic or life-limiting illnesses. Our core competencies include restorative care, longitudinal care and care through the end of life. Our service lines include assisted living/skilled nursing/rehabilitation, home health, home infusion/pharmacy services, home medical equipment, hospice and palliative care, Program of All-Inclusive Care for the Elderly (PACE), personal home services/private duty care and supportive housing.\n\nProvidence is proud to be an Equal Opportunity Employer. We are committed to the principle that every workforce member has the right to work in surroundings that are free from all forms of unlawful discrimination and harassment on the basis of race, color, gender, disability, veteran, military status, religion, age, creed, national origin, sexual identity or expression, sexual orientation, marital status, genetic information, or any other basis prohibited by local, state, or federal law. We believe diversity makes us stronger, so we are dedicated to shaping an inclusive workforce, learning from each other, and creating equal opportunities for advancement.\n\nRequsition ID: 270390\n\nCompany: Providence Jobs\n\nJob Category: Nursing-Patient Facing\n\nJob Function: Nursing\n\nJob Schedule: Full time\n\nJob Shift: Day\n\nCareer Track: Nursing\n\nDepartment: 3304 HOME HEALTH WA SEATTLE\n\nAddress: WA Tukwila 2811 S 102nd St\n\nWork Location: Riverfront Technical Park-Tukwila\n\nPay Range: $44.48 - $70.41\n\nThe amounts listed are the base pay range; additional compensation may be available for this role, such as shift differentials, standby/on-call, overtime, premiums, extra shift incentives, or bonus opportunities.\n\nCheck out our benefits page for more information about our Benefits and Rewards.\n\nPandoLogic. Keywords: Wound Care Nurse, Location: TUKWILA, WA - 98104",
    "location": "Tukwila, WA",
    "application_url": "https://ibmprovidencehealth.thejobnetwork.com/Job/592522628",
    "keywords": [
      "RN",
      "Registered Nurse",
      "Wound Specialist",
      "Home Health",
      "Wound Care",
      "WOCN",
      "BLS",
      "Washington State License",
      "Nursing Experience",
      "Interdisciplinary Team",
      "Patient Care",
      "Community Health",
      "King County",
      "Providence",
      "Monday-Friday",
      "Day Shift",
      "Full Time",
      "Mileage Reimbursement",
      "Benefits",
      "Nursing Process"
    ]
  }
]
