[
  {
    "id": "li-4290074852",
    "title": "Registrar",
    "company": "Corewell Health",
    "location": "Royal Oak, MI",
    "description": "Position details: full\\-time Monday to Friday, day shift 8:30am\\-5:00pm.\n   \n\n  \n\n**Job Summary**\n Under the direction of the Patient Access Registration Front Line Manager, the Acute Care Hospital Registrar 1 is accountable to ensure a smooth timely registration/admission process by obtaining accurate individual demographic, clinical and insurance data; collecting co\\-pay/deductible, residual and prior balances, perform initial financial screening on all self\\-pay \\& out of network patients and then referring them to the Financial Advisors as necessary while providing optimal customer satisfaction; reception; and provides patient way finding as required.\n   \n\n  \n\n**Essential Functions**\n* Greet customers promptly with a warm and friendly reception. Direct patients to appropriate setting, explaining and apologizing for any delays. Maintain professionalism and diplomacy at all times, following specific standards as defined in the department professionalism policy. Register patients for each visit type and admit type and area of service via EPIC (Electronic Medical Record\\- EMR). Collects and documents all required demographic and financial information. Appropriately activates converts and discharges visits on EPIC.\n* Accurately and efficiently performs registration and financial functions to include: Thorough interviewing techniques, registers patients in appropriate status, following registration guidelines while ensuring the accurate and timely documentation of demographic and financial data; obtains the appropriate forms and scans into the medical record as per department protocol.\n* Scrutinize patient insurance(s), identifies the correct insurance plan, selects appropriately from the EPIC and documents correct insurance order. Applies recurring visit processing according to protocol. May facilitate use of electronic registration tools where available (Kiosks, etc.).\n* Verify patient information with third party payers. Collect insurance referrals and documents on EPIC. Communicate with patients and physician/office regarding authorization/referral requirements. Obtain financial responsibility forms or completed electronic forms with patients as necessary.\n* Review/obtain/witness hospital consent forms, and Notice of Privacy Practices with patient/family. Screen outpatient visits for medical necessity. Provide cost estimates. Collects and documents Advance Directive information, educating and providing information as necessary. Collects and documents Medicare Questionnaire, issue Medicare Inpatient Letter \\& Medicare Off\\-site Notifications as required by Government mandates. Scan appropriate documents. Manage all responsibilities within Compliance guidelines as outlined in the Hospital and Department Compliance Plans and in accordance with Meaningful Use requirements.\n* Financial Advocacy: Screen all patients self\\-pay \\& out of network patients using the EPIC tools. Provide information for follow up and referral to the Financial Advisor as appropriate. Initiate payment plans and obtain payment, Informs and explains to patients/families all applicable government and private funding programs and other cash payment plans or discounts. Incorporates POS (point of service) collection processes into their daily functions.\n* May issue receipts and complete cash balance sheets in specified areas where appropriate. Utilize audits and controls to manage cash accurately and safely.\n* Transcribe written physician orders, communicating with physician/office staff as necessary to clarify. Determine \\& document ICD\\-10 codes. Performs medical necessity check and issue ABN as appropriate for Medicare primary outpatients. Note: excluding lab\\-only outpatients effective September.\n* Affix wristbands to patients, prepare patient charts. Manage/prepare miscellaneous reports, schedules and paperwork. Maintain inventory of supplies.\n* May facilitate scheduling in identified areas for ancillary testing.\n* Mark duplicates Medical Records for merge: identify potential duplicate records to determine that the past and current records are truly the same. Utilize all system resources and contact patient if necessary.\n* May act as a preceptor to a newer staff member.\n* Maintains or exceed the department specific individual productivity standards, collection targets, quality audit scores for accuracy productivity, collection and standards for registrations/insurance verifications.\n* Provide excellent service to our clinical and “downstream” departments and physicians as users of our registration services. Contribute to process improvement activities to support an efficient patient and process flow.\n* Clerical duties including i.e., typing, filing, mailing, calling patients to form groups or to obtain case history, copying, faxing, receiving payments and funding applications.\n* Maintains or exceeds the Corewell Health Customer Service Standards: Service, Ownership, Attitude, and Respect. Provide every customer with a seamless, flawless Corewell Health experience.\n* Remain compliant with regular TB testing \\& Flu vaccination per Hospital requirements.\n\n\n**Qualifications**\n Required\n   \n\n  \n\n* High School Diploma or equivalent\n* 1 year of relevant experience customer service role or health care industry\n* Must be 18 years of age, as required to co\\-sign legal documents (hospital consent forms, etc).\n* Proficient in medical terminology and has assimilated the proficient typing requirements (30 words/min).\n\n\n**Preferred**\n* Windows, Excel, Word, Outlook, EPIC, Electronic Eligibility System and various websites for third party payers for verification.\n\n\n**About Corewell Health**\n As a team member at Corewell Health, you will play an essential role in delivering personalized health care to our patients, members and our communities. We are committed to cultivating and investing in YOU. Our top\\-notch teams are comprised of collaborators, leaders and innovators that continue to build on one shared mission statement \\- to improve health, instill humanity and inspire hope. Join a nationally recognized health system with an ambitious vision of continued advancement and excellence.\n   \n\n  \n\n How Corewell Health cares for you\n   \n\n  \n\n* Comprehensive benefits package to meet your financial, health, and work/life balance goals. Learn more here.\n* On\\-demand pay program powered by Payactiv\n* Discounts directory with deals on the things that matter to you, like restaurants, phone plans, spas, and more!\n* Optional identity theft protection, home and auto insurance, pet insurance\n* Traditional and Roth retirement options with service contribution and match savings\n* Eligibility for benefits is determined by employment type and status\n\n\n**Primary Location**\n SITE \\- Healthcare Center Royal Oak \\- 4949 Coolidge Hwy \\- Royal Oak\n   \n\n  \n\n**Department Name**\n Physical Therapy BHC \\- Royal Oak\n   \n\n  \n\n**Employment Type**\n Full time\n   \n\n  \n\n**Shift**\n Day (United States of America)\n   \n\n  \n\n**Weekly Scheduled Hours**\n 40\n   \n\n  \n\n**Hours of Work**\n 8:30 a.m. to 5 p.m.\n   \n\n  \n\n**Days Worked**\n Monday to Friday\n   \n\n  \n\n**Weekend Frequency**\n N/A\n   \n\n  \n\n********CURRENT COREWELL HEALTH TEAM MEMBERS – Please apply through Find Jobs from your Workday team member account. This career site is for Non\\-Corewell Health team members only.********\n*Corewell Health is committed to providing a safe environment for our team members, patients, visitors, and community. We require a drug\\-free workplace and require team members to comply with the MMR, Varicella, Tdap, and Influenza vaccine requirement if in an on\\-site or hybrid workplace category. We are committed to supporting prospective team members who require reasonable accommodations to participate in the job application process, to perform the essential functions of a job, or to enjoy equal benefits and privileges of employment due to a disability, pregnancy, or sincerely held religious belief.*\n*Corewell Health grants equal employment opportunity to all qualified persons without regard to race, color, national origin, sex, disability, age, religion, genetic information, marital status, height, weight, gender, pregnancy, sexual orientation, gender identity or expression, veteran status, or any other legally protected category.*\n*An interconnected, collaborative culture where all are encouraged to bring their whole selves to work, is vital to the health of our organization. As a health system, we advocate for equity as we care for our patients, our communities, and each other. From workshops that develop cultural intelligence, to our inclusion resource groups for people to find community and empowerment at work, we are dedicated to ongoing resources that advance our values of diversity, equity, and inclusion in all that we do. We invite those that share in our commitment to join our team.*\n*You may request assistance in completing the application process by calling 616\\.486\\.7447\\.*",
    "keywords": [
      "Registrar",
      "Patient Registration",
      "EPIC",
      "Insurance Verification",
      "Customer Service",
      "Medical Terminology",
      "Healthcare",
      "Patient Access",
      "Financial Screening",
      "ICD-10",
      "Medicare",
      "Demographic Data",
      "Medical Records",
      "Compliance",
      "Point of Service Collection",
      "Authorization",
      "Referrals",
      "Advance Directives",
      "High School Diploma",
      "Medical Necessity"
    ]
  },
  {
    "id": "li-4279054200",
    "title": "Jr. Digital Graphic Designer",
    "company": "Fabletics",
    "location": "El Segundo, CA",
    "description": "**Job Description**\n**Fabletics** \n is looking for a\n **Jr. Digital Graphic Designer.**\n**How do you Fit in?**\n The Jr. Digital Graphic Designer is responsible for the execution of digital communications that translate business and marketing objectives into designs that are clear, compelling, visually exciting, and easy to understand. This person will understand the Fabletics customer and has clean design aesthetics.\n   \n\n  \n\n In this role, you will have the opportunity to help contribute to the overall art direction of the business and work across multiple channels. Developing, contributing and collaborating—you will help with compelling design for emails and our marketing initiatives. You must be willing to roll up your sleeves, help develop, plan and execute. You will need strong organizational and interpersonal skills to excel in this role. Fabletics is particularly looking for a highly motivated, do\\-it\\-yourself individual who thrives in an entrepreneurial environment.\n   \n\n  \n\n* Please submit your portfolio/website to be considered for this role.\n\n\n You will report to the\n **Sr. Art Director** \n and partner closely with\n **Creative** \n ,\n **Project Management, CRM, and Marketing**\n**What You Will Do**\n* Conceptualizes, elevates, maintains, and is accountable for quality of work and timeliness of delivery across multiple creative projects\n* Helps with the design for site, email marketing and social media projects across all platforms by collaborating with cross departments\n* Works directly with the marketing, copywriting, merchandising, and project management team to help create engaging, inspiring and on brand marketing emails and other projects on a weekly/monthly basis\n* Works within templates that communicate Fabletics marketing goals and expansion\n* Weekly design of site updates: home page slides, category banners, templates, landing pages and more\n* Ensures on time and accurate delivery of all short and long term initiatives\n* Demonstrates flexibility, organization skills and the ability to multi\\-task\n* Having a positive, proactive, self\\-starting attitude\n* Ensures high standards and quality assurance across all work produced so that it is cohesive, consistent, and brand\\-right\n* Learn and leverage knowledge of our customers and company KPI’s to assure we are creating optimal assets\n* Special print design opportunities:\n+ Design PR materials, advertising and other print marketing materials\n+ Understands and prepares mechanicals for trim and packaging production\n+ Provide print solutions that are technically feasible and innovative, and establish competency of printer’s capabilities\n\n\n**What You Can Bring**\n* Based in LA\n* 1\\-2 years of experience in graphic design with emphasis in ecommerce and fashion or internship equivalent\n* Bachelor’s Degree in Multimedia Design or Web Design or equivalent experience is preferred\n* Expert knowledge of Adobe Creative Suite including Photoshop, InDesign, Illustrator\n* Possess a passion for, and strength in, recognizing excellent web typography and photography\n* Collaborate in the development of project concepts, and apply a consistent design approach to a wide range of digital content\n\n\n**Nice To Have, But We’ll Teach You**\n* Figma prototyping and slides\n\n\n**Where We Are**\n* This role will be based in our El Segundo Headquarters\n\n\n**Compensation \\& Total Rewards**\n At Fabletics, we believe work and life should fit together! We continue to build a culture of flexibility, to empower you to do your best and put yourself first. Our Total Rewards program rewards employees for their hard work, supporting their health, well\\-being, families, and ultimately their life journey. Total Rewards at Fabletics includes:\n   \n\n  \n\n  \n\n  \n\n* Hybrid Work Schedule\\*\n* Discretionary Paid Time Off\\*\n* Summer Fridays\\*\n* Healthcare Plans\n* Employee Discounts\n* 401k\n* Annual Bonus Program\n* Equity Program\\*\n* And More\n\n\n  \n\n  \n\n* Varied for retail, fulfillment and fully remote roles.\n\n\n The hourly range for this position is from $26\\.68\\-$28\\.85/hr. The range provided includes the base salary that Fabletics expects to pay for the role. Offered hourly rate will be dependent on factors including the scope and complexity of the role, candidate’s related work experience, subject matter expertise and work location.\n   \n\n  \n\n**Security Alert: Protect yourself from scams**\n At Fabletics, we're dedicated to recruiting top talent who share our drive for innovation. To safeguard candidates, Fabletics emphasizes legitimate recruitment practices. Initial communication is primarily via official email addresses and LinkedIn; beware of deviations. Personal data and sensitive information will not be solicited during the application phase. Interviews are conducted via phone, in person, or through the approved platforms Teams or Zoom—never via messaging apps or other calling services. Offers are merit\\-based, communicated verbally, and followed up in writing. If personal information is requested to initiate the hiring process, rest assured it will be through secure and protected means.\n   \n\n  \n\n Fabletics, Inc. is an equal opportunity employer. We recruit, employ, compensate, develop, and promote regardless of race, national origin, religion, sex, sexual orientation, gender identity, age, disability, genetic information, veteran status, and other protected status as required by applicable. At Fabletics, Inc., we champion a vibrant workplace culture that thrives on diversity law and do not tolerate discrimination or harassment. We are one team from many backgrounds, innovating through diversity of individuals, who are driven by passion for creating an inclusive space for all. Fabletics, Inc. will continue to champion a workplace culture that prizes diversity and inclusivity.\n   \n\n  \n\n We encourage you to apply regardless of meeting all qualifications and/or requirements.",
    "keywords": [
      "Jr. Digital Graphic Designer",
      "Adobe Creative Suite",
      "Photoshop",
      "InDesign",
      "Illustrator",
      "ecommerce",
      "fashion",
      "email marketing",
      "social media",
      "web design",
      "typography",
      "photography",
      "portfolio",
      "brand consistency",
      "templates",
      "landing pages",
      "print design",
      "collaboration",
      "marketing",
      "Creative Suite",
      "Figma"
    ]
  },
  {
    "id": "li-4278975791",
    "title": "Designer — Branding and Marketing",
    "company": "Sullivan",
    "location": "New York, NY",
    "description": "**Location:** \n NYC (Hybrid)\n   \n\n  \n\n**Team:** \n Creative\n   \n\n  \n\n**Who We Are**\n At Sullivan, we help organizations of consequence build brands that are as bold as they are strategic—and bring them to life through powerful marketing and campaign work. We’re endlessly curious, fiercely collaborative, and always pushing for creative that connects with people and drives real results.\n   \n\n  \n\n**What You’ll Do**\n As a\n **Designer** \n , you’ll help lead the charge in creating high\\-impact, idea\\-driven work that translates strategy into campaigns people actually care about and brand Identities that people fall in love with. You are equally driven by idea and craft.\n   \n\n  \n\n You’ll collaborate with strategists, copywriters, and creative directors to shape ideas from to full expression—across digital, social, video, and more.\n   \n\n  \n\n This role is ideal for a designer who thrives on ideas and pushes creative to unexpected places.\n ***You will:***\n* Extend creative to channel\\-smart campaign assets\n* Design across formats—from paid social and digital ads to landing pages, presentations, motion, and video\n* Partner with copywriters to explore and express ideas\n* Bring rigor, attention to detail, and polish to final deliverables\n\n\n**WHAT YOU BRING**\n* 4–8 years of design experience in an agency or creative studio, with a focus on identity development, marketing, and campaign work\n* A portfolio that shows both concept\\-driven design and real\\-world execution across channels\n* Strong visual storytelling and a clear point of view\n* Mastery of layout, type, digital design, and motion principles\n* Confidence in presenting your ideas and articulating the “why” behind them\n* A collaborative spirit and an openness to feedback and iteration\n\n\n**WHY YOU’LL LOVE WORKING HERE**\n* A tight\\-knit team that values originality, insight, and creative bravery\n* A culture that blends high standards with humor and heart\n* The opportunity to work on meaningful brands that are shaping their industries\n* Space to grow, take creative risks, and lead ambitious work\n\n\n Salary range: $100\\-$115k",
    "keywords": [
      "Designer",
      "Branding",
      "Marketing",
      "Creative",
      "Campaign",
      "Brand Identity",
      "Digital",
      "Social",
      "Video",
      "Motion",
      "Portfolio",
      "Agency",
      "Studio",
      "Visual Storytelling",
      "Layout",
      "Typography",
      "Collaboration",
      "Strategy",
      "Copywriter",
      "Creative Director"
    ]
  },
  {
    "id": "li-4290432037",
    "title": "Manager, Sports Events",
    "company": "Red Bull",
    "location": "Atlanta, GA",
    "description": "The Manager of Sports Events drives the development of national properties, large\\-scale events, and essential event initiatives in the region, creating points of difference and driving brand image. Reporting to Sr. Manager of Sports Marketing, you will be a project leader, working with all key stakeholders to maximize the impact of major regional Sports event initiatives. Responsibilities include all elements of event execution, from creative development to concept, execution, and evaluation. You will collaborate with and provide direction and assistance to the local field teams to use all Sports properties and Red Bull partners in host markets. This includes informing goal setting, identifying key scenes and relationships, and guiding relevant initiatives following national and regional events that occur within the region.\n   \n\n  \n\n**All the responsibilities we'll trust you with:**\n**LEAD EXECUTION OF ALL REGIONAL SPORTS EVENTS**\n Lead quality event execution and production for all region Red Bull Sports events. Fiscally responsible for event budgets on assigned projects. Identify and propose sites for event properties based on local market needs and expected ROI. Develop project plan, oversee its execution, and lead the project team. Oversee all elements of pre\\-planning and event execution. Be the liaison between Red Bull and local authorities to secure all appropriate authorization. Ensure information is spread between team members and partners. You will work with Legal to construct contracts, put contracts out for bid, assess the best proposals, and negotiate the best prices for all relevant partners/suppliers. Sources and manages event production companies and oversees all event logistics. Work with media agencies on the development of Above\\-the\\-Line strategies and execution. Partner with the regional Communications team to maximize media outcomes of important projects. Work with Region Leadership and Santa Monica teams to inform region Sports Marketing strategy. Work with Risk Management and Legal departments to facilitate all necessary agreements with outside parties according to Red Bull standards.\n   \n\n  \n\n**SUPPORT PRODUCT ACTIVATION**\n Work with local Brand Marketing and sales teams to develop activation plans that create relevance locally. You will manage the distribution of event collateral for the region. Work with Region Marketing Leadership and 3rd parties to develop new event branding solutions.\n   \n\n  \n\n**SHARE BEST PRACTICES**\n Participate in meetings such as Brand Marketing creative workshops and trainings to gather and share insights and align strategies. Identify and share best practices across the region, including with the marketing team and sports department. Drive ROI with the Regional Communications team to ensure external communication (external)—this includes creating and managing the content distribution of local initiatives to relevant channels (viral, print, video).\n   \n\n  \n\n**Your areas of knowledge and expertise that matter most for this role:**\n* 3\\+ years of relevant experience in event, project, team coordination, and budget management\n* Experience with event and project management\n* Find us creative and unique solutions for project execution\n* Knowledge of several sports and their respective scenes on a regional and national level\n* Experience managing budgets of more than $400,000\n* Contract and negotiation skills – constructing and reviewing the most advantageous agreements with suppliers/external partners\n* Experience with relevant distribution outlets (all communication channels)\n* Experience with TV and video production programming\n* History of credible collaboration with local governments, demonstrating an understanding of local approval systems and regulations\n* Plan and project management competencies\n* Creative mind with experience putting new ideas into practice and assessing results\n* Must be proficient in Microsoft Suite\n* Bachelor's degree or equivalent work experience\n* Must be fluent in English; additional language skills an advantage\n* Must have a valid US Drivers License\n\n\n This position is open to U.S. citizens, U.S. permanent residents, or individuals who are currently authorized to work in the United States on a valid visa.\n   \n\n  \n\n The base salary range for this position is $85,600 to $128,400 \\+ cash incentives. Actual salary offers may vary based on work experience. The base pay range is subject to change and may be modified.\n   \n\n  \n\n Our current Benefits include:\n   \n\n  \n\n Comprehensive Medical, Dental and Vision Plans, 401k Match, Family Leave, PTO \\& Paid Holiday Schedule, Pet, Legal, and Life Insurance, Tuition Reimbursement (Benefits listed may vary depending on the nature of your employment and/or work location)\n   \n\n  \n\n Red Bull North America, Inc. is an Equal Opportunity Employer, and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, veteran status, age, or any other classification protected by Federal, state, or local law.",
    "keywords": [
      "Sports Events",
      "Event Management",
      "Project Management",
      "Budget Management",
      "Sports Marketing",
      "Event Production",
      "Contract Negotiation",
      "Event Execution",
      "Brand Marketing",
      "Media Relations",
      "Communications",
      "ROI Analysis",
      "Event Planning",
      "Stakeholder Management",
      "Risk Management",
      "Regional Marketing",
      "Content Distribution",
      "TV Production",
      "Government Relations",
      "Microsoft Suite"
    ]
  },
  {
    "id": "li-4276245863",
    "title": "Creative Producer, Design Editorial and Brand",
    "company": "Meta",
    "location": "New York, NY",
    "description": "This role develops, produces and curates content for design\\-related publishing channels at Meta, including a website (design.facebook.com) and social media channels (@DesignatMeta). Our publishing channels celebrate our global product teams, their work across Meta technologies and how we collaborate around our mission of building the future of human connection and the technology that makes it possible. Our design teams create and build Meta technologies — Facebook, Instagram, WhatsApp, Threads, Meta AI, Meta Glasses, Meta Horizon — for billions of people around the world. We are looking for an experienced creative producer to guide the design\\-focused editorial strategy and production work across all publishing channels, overseeing and continually iterating on the content development process and acting as a guide for the team’s day\\-to\\-day work. This individual will have opportunities to guide and mentor a growing team of contractors focused on creative content development — including text and communications design — as well as vendor partners who support external community engagement, website development and paid media campaigns. Overall, they will be adept at balancing the need for high\\-quality work while keeping up with the pace of an organization known for moving fast. This individual will have the opportunity to create and lead communications initiatives that directly impact an external global audience of design practitioners, prospective candidates and the internal Design community at Meta.\n   \n\n  \n\n Creative Producer, Design Editorial and Brand Responsibilities:\n   \n\n  \n\n* Lead creative editorial strategies, executions and content development across publishing channels for Design at Meta\n* Help define and drive the external brand strategy for Design at Meta and serve as a strategic consultant for external communications and brand\\-related initiatives across the global Design community\n* Collaborate closely with partners throughout Design, Communications, Legal, Brand and other organizations company\\-wide to deliver global integrated publishing initiatives\n* Steward the integrated processes with the team and cross\\-functional partners, from concept, launch, iteration and optimization\n* Distill and craft high\\-quality creative briefs together with teammates\n* Lead effective relationships with external agencies, using communication plans, briefs, and budget tracking tools to guide differentiated storytelling and execution\n* Demonstrated experience presenting to Design leadership, cross\\-functional leadership and stakeholders\n* Lead escalation of particularly risky, complex, innovative or significant program concerns or blockers with leadership\n* Create and identify key editorial strategies that not only drive interest and capture new audiences, but sustain existing long\\-term relationships\n* Ideate and develop new tools and resources to continually improve program management and processes for the team\n* Lead team meetings and cross\\-functional project collaborations\n* Review and approve short\\- and long\\-form multimedia content, with care for societal nuance, inclusiveness, accessibility, risk, grammar, punctuation and more\n* Serve as a guide, thought partner, and mentor for teammates working across a range of initiatives, which requires depth and breadth of editorial knowledge and the publishing landscape\n* Works strategically and efficiently in a time\\-sensitive environment, escalating priorities and working with cross\\-functional teams to make crucial decisions in the midst of campaign execution\n\n\n Minimum Qualifications:\n   \n\n  \n\n* 6\\+ years of experience developing and driving insight\\-fueled marketing, editorial or communications\\-related strategies at an agency or consumer brand\n* Experience managing creative, complex and multi\\-channel campaigns (including advertising, communication, content, email, social, events, web, sales enablement, and product education) in partnership with marketing, creative and production teams\n* Experience composing creative briefs\n* Well\\-versed in various publishing channels—like websites, social media platforms and more—with a basic understanding of channel function and formats\n* Demonstrates an understanding of marketing and recruiting funnels and how different tactics and channels drive impact across the entirety of distinct audience journeys\n* Experience delivering design\\-driven marketing, editorial or communications campaigns under tight deadlines\n* Experience with analyzing and drawing conclusions from a broad set of data and turning that into actionable recommendations\n* Experience strategically managing a plan and its objectives at a high level, while still managing the details of execution\n* Experience working successfully in a time\\-sensitive environment working under your own initiative, time management, task prioritization, flexibility and keen ability to identify problems and proactively work towards solutions\n* Demonstrated ability to manage projects from start to finish, improvise and shift strategy and operate with ambiguity\n* Demonstrated communication and organization skills\n* Bachelor's degree\n\n\n Preferred Qualifications:\n   \n\n  \n\n* Experience in marketing, branding, public relations, journalism or related field\n* Experience in the technology and design industries\n* Experience leading a marketing communications or brand team\n* Experience in crisis communications management and rapid response\n* Experience working on global brands and developing strategies/work for multiple regions or markets\n* Experience working for a developing or emerging brand with multiple products\n* Experience in consumer product categories and brands, such as consumer technology and hardware\n* Experience collaborating with leadership, colleagues and other cross\\-functional stakeholders to deliver high\\-quality work in a results\\-oriented environment\n* Capacity to lead long and short term strategic planning\n* Enthusiasm for Meta technologies and the people that we serve\n* A track record of organizational skills, attention to detail, and on\\-deadline delivery\n\n\n About Meta:\n   \n\n  \n\n Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n   \n\n  \n\n Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E\\-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment.\n   \n\n  \n\n Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations\\-ext@fb.com.\n   \n\n  \n\n $147,000/year to $205,000/year \\+ bonus \\+ equity \\+ benefits\n   \n\n  \n\n Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta.",
    "keywords": [
      "Creative Producer",
      "Design Editorial",
      "Brand Strategy",
      "Content Development",
      "Publishing Channels",
      "Marketing Communications",
      "Multi-channel Campaigns",
      "Creative Briefs",
      "Cross-functional Collaboration",
      "Project Management",
      "Editorial Strategy",
      "Social Media",
      "Website Management",
      "Brand Management",
      "Campaign Execution",
      "Stakeholder Management",
      "Design Industry",
      "Technology",
      "Global Campaigns",
      "Meta"
    ]
  },
  {
    "id": "li-4278930105",
    "title": "Executive Recruiter, VP Practice",
    "company": "Google",
    "location": "New York, NY",
    "description": "Applicants in San Francisco: Qualified applications with arrest or conviction records will be considered for employment in accordance with the San Francisco Fair Chance Ordinance for Employers and the California Fair Chance Act.\n   \n\n  \n\n Note: By applying to this position you will have an opportunity to share your preferred working location from the following:\n **Austin, TX, USA; Atlanta, GA, USA; Chicago, IL, USA; Mountain View, CA, USA; New York, NY, USA; Seattle, WA, USA; San Francisco, CA, USA** \n .\n **Minimum qualifications:**\n* 8 years of experience in executive search, advising clients on talent and hiring, managing the search process including setting and adjusting search strategy, working with internal or external research teams, and supporting applicants through the interview and offer process.\n* 8 years of experience in hiring executives (e.g. VP\\+ talent).\n* 5 years of experience in the technology sector, in a corporate or executive search firm environment.\n\n\n**Preferred qualifications:**\n* 4 years of experience in recruiting with AI/ML or cloud technologies.\n* Experience partnering with key stakeholders to deliver high quality search deliverables, including internal executive researchers and external executive search firms.\n\n\n**About the job** \n Google's known for our innovative technologies, products and services \\-\\- and for the people behind them. As part of our recruiting team, you're charged with finding the most interesting candidates who bring an entrepreneurial spirit to all they do. You're responsible for guiding candidates through our hiring process and connecting them to the magic of working at Google. You are creative and driven, which allows you to develop lasting relationships with both candidates and hiring managers. You're also comfortable with numbers and drawing insights from analytics to make our hiring process smarter and more efficient.\n   \n\n  \n\n As an Executive Recruiter, VP Practice, you will focus on hiring the best executive talent, representative of all users, enabling Google to build for an innovative and sustainable future.\n   \n\n  \n\n We are trusted advisors to the leadership at Google, relied on for advice about the outside talent market as well as how it compares to the talented Googlers we already have in the organization. With a perspective on the external technical talent landscape and deep insights into Google’s business priorities, you will be part of a team developing search strategies and leading engagements to hire Vice Presidents for Google's technical portfolios.The US base salary range for this full\\-time position is $158,000\\-$235,000 \\+ bonus \\+ equity \\+ benefits. Our salary ranges are determined by role, level, and location. Within the range, individual pay is determined by work location and additional factors, including job\\-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.\n   \n\n  \n\n Please note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google .\n   \n\n  \n\n**Responsibilities**\n* Provide guidance to clients as they define the senior technical talent and organization leaders needed to drive Google’s strategy.\n* Act as a domain talent expert, providing valuable assessments and insights based on the knowledge of the talent pool.\n* Engage our research team, network relationships and other search resources to identify, engage, evaluate and recruit executive level applicants.\n* Guide businesses throughout the search process, providing consistent communication and incredible client service.\n* Develop an understanding of each applicant's leadership style, personal background, professional history, and specific fit to the role.\n\n\n Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .",
    "keywords": [
      "Executive Recruiter",
      "VP Practice",
      "executive search",
      "talent acquisition",
      "hiring executives",
      "technology sector",
      "AI/ML",
      "cloud technologies",
      "stakeholder partnership",
      "search strategy",
      "candidate evaluation",
      "leadership assessment",
      "technical talent",
      "organizational leaders",
      "research team",
      "network relationships",
      "client service",
      "professional history",
      "leadership style",
      "Google"
    ]
  },
  {
    "id": "li-4299067547",
    "title": "Assistant Manager, Global Marketing - Too Faced",
    "company": "The Estée Lauder Companies Inc.",
    "location": "Irvine, CA",
    "description": "**The Estée Lauder Companies Inc.** \n is one of the world’s leading manufacturers, marketers, and sellers of quality skin care, makeup, fragrance, and hair care products, and is a steward of luxury and prestige brands globally. The company’s products are sold in approximately 150 countries and territories under brand names including: Estée Lauder, Aramis, Clinique, Lab Series, Origins, M·A·C, La Mer, Bobbi Brown Cosmetics, Aveda, Jo Malone London, Bumble and bumble, Darphin Paris, TOM FORD, Smashbox, AERIN Beauty, Le Labo, Editions de Parfums Frédéric Malle, GLAMGLOW, KILIAN PARIS, Too Faced, Dr.Jart\\+, the DECIEM family of brands, including The Ordinary and NIOD, and BALMAIN Beauty.\n   \n\n  \n\n**Description**\n Job Description: Assistant Manager, Global Marketing\n   \n\n  \n\n**Overview**\n The Assistant Manager, Global Marketing plays a key role in supporting the development and execution of global consumer engagement strategies. Reporting to the Executive Director of Global Marketing, this role collaborates cross\\-functionally to activate brand initiatives, manage global marketing calendars, and ensure seamless coordination with regional teams and creative partners. This position offers the opportunity to drive innovation and consistency across multiple channels within a dynamic and fast\\-paced environment.\n   \n\n  \n\n**Key Responsibilities**\n* Support the Global Marketing team in annual planning, product launch execution, and commercial innovation initiatives.\n* Maintain and regularly update the global marketing activation calendar to reflect brand priorities and campaign timelines.\n* Collaborate across functions to bring 360° brand initiatives to life, ensuring cohesive consumer engagement across all channels.\n* Develop and manage creative briefs and localized adaptations in partnership with the Creative team to meet marketing objectives.\n* Manage the ACL checklist process and act as the day\\-to\\-day point of contact for global regions. Facilitate alignment between Global Marketing, Creative, and regional partners on PDP asset needs, best\\-in\\-class practices, and support capabilities.\n* Create compelling brand presentations to communicate strategies, campaign plans, and key initiatives to internal and external stakeholders.\n* Serve as the liaison with the Creative department to ensure timely delivery of global assets.\n* Lead global consumer review sampling programs (e.g., Topbox), from planning to execution.\n* Conduct ongoing competitive analysis to keep Too Faced at the forefront of the industry.\n* Act as the first point of contact for regional consumer engagement briefs, ensuring alignment and global support where required.\n\n\n**Qualifications**\n Required:\n   \n\n  \n\n* Bachelor’s degree in Marketing, Business, Communications, or a related field\n* 3\\+ years of experience in global or regional marketing, preferably within the beauty or consumer packaged goods industry\n* Proven ability to manage multiple projects simultaneously with strong attention to detail including managing timelines\n* Excellent communication, collaboration, and presentation skills\n* Strong understanding of multi\\-channel marketing (digital, in\\-store, social, etc.)\n* Proficiency in Microsoft Office Suite (PowerPoint, Excel, Word)",
    "keywords": [
      "Global Marketing",
      "Assistant Manager",
      "Too Faced",
      "consumer engagement",
      "cross-functional collaboration",
      "brand initiatives",
      "marketing calendar",
      "product launch",
      "creative briefs",
      "campaign plans",
      "multi-channel marketing",
      "competitive analysis",
      "project management",
      "beauty industry",
      "Bachelor's degree",
      "3+ years experience",
      "communication skills",
      "presentation skills",
      "Microsoft Office",
      "regional marketing"
    ]
  },
  {
    "id": "li-4300281788",
    "title": "Athletics Communications Coordinator",
    "company": "Flagler College",
    "location": "St Augustine, FL",
    "description": "Flagler College is a private liberal arts college located in St. Augustine, Florida. Founded in 1968, our mission is to enrich lives by creating a thoughtful, personalized experience in a supportive educational community.\n   \n\n  \n\n READY TO JOIN OUR COMMUNITY?\n   \n\n  \n\n We are here to help. Please review our current job openings and benefit offerings to determine if Flagler College is the place for you.\n   \n\n  \n\n The Athletics Communications Coordinator is a full\\-time, 12\\-month position that reports to the Associate Director of Athletics. This position will also be required to communicate effectively and work efficiently with the Flagler College Sports Information Director.",
    "keywords": [
      "Athletics Communications",
      "Coordinator",
      "Flagler College",
      "Sports Information Director",
      "Associate Director of Athletics",
      "full-time",
      "12-month position",
      "St. Augustine Florida",
      "private liberal arts college",
      "communications",
      "athletics",
      "sports information",
      "media relations",
      "marketing",
      "public relations",
      "content creation",
      "social media",
      "event management",
      "writing skills",
      "teamwork"
    ]
  },
  {
    "id": "li-4287670117",
    "title": "Sales Strategic Planning & Operations Lead",
    "company": "Meta",
    "location": "New York, NY",
    "description": "The mission of our Sales Strategic Planning and Operations (SSPO) function is to drive efficient revenue growth and product adoption by aligning the business to monetization priorities and transforming our business into a data\\-driven organization. Meta is seeking an experienced business leader to help in setting strategic direction, designing, scaling, and optimizing the internal tools, processes and frameworks that increase the efficiency and effectiveness of our Sales organization. They will work closely with our Global and Regional SSPO teams, Product partners, Sales leaders, Data Science partners and core cross\\-functional teams to surface insights, ensure our processes evolve with the needs of our business and integrate with our internal tools.This role requires someone who has a skillset to manage a range of tasks, including but not limited to product and processes development and optimization, business goal definition, data\\-driven business reviews, stakeholder management/driving alignment, internal communications, ad hoc data analysis, and contribution to the team and values.\n   \n\n  \n\n Sales Strategic Planning \\& Operations Lead Responsibilities:\n   \n\n  \n\n* Lead the identification of tooling requirements to enhance the selling experience\n* Guide the development of processes and tools that enable more efficient business performance\n* Test and iterate on these tools and processes\n* Prepare the GTM and launch tools and processes with the right training and enablement material\n* Develop and execute change management plans (incl. goal setting) to ensure successful adoption\n* Leverage the new processes and tools built to collect structured data and generate insights that inform sales GTM\n\n\n Minimum Qualifications:\n   \n\n  \n\n* 8\\+ years of experience in management consulting, product management, finance, or similar sales strategy and operations roles\n* Bachelor’s Degree\n* Leadership and influencing skills – experience leading/influencing stakeholders at all levels of an organization\n* Experience working cross\\-functionally with leadership in developing and executing successful plans in an environment of fast growth and ambiguity\n* Results and detail oriented, with commercial/business acumen and demonstrated experience in translating complex concepts and terminology in order to drive understanding and buy\\-in from a broad range of stakeholders\n* Experience of consistently working under your own initiative, seeking feedback and input where appropriate combined with new opportunities for the larger organization and influencing operational efficiency initiatives in a cross\\-functional environment\n* Demonstrated to design and launch organization\\-wide scalable processes that promote governance and accountability\n* Demonstrated program management skills to drive large\\-scale projects to fruition, including goal setting, action planning, risk management, milestone tracking, KPI tracking, progress reporting and communications\n* Demonstrated experience in SQL, spreadsheets (e.g. Excel, Google Sheets) and presentations (e.g. PowerPoint, Slides)\n* Experience shifting priorities, balancing multiple initiatives at once, and maintaining organization\n* Familiarity with Meta’s platforms and products, has a proven track record of proactive operational leadership in a cross\\-functional environment, and can move fast to drive results\n\n\n Preferred Qualifications:\n   \n\n  \n\n* Master's or graduate degree\n* Experience in technology industry\n* Experience in Enterprise SaaS businesses, sales operations, and programs\n* Experience developing and/or overseeing advanced quantitative analysis and deriving actionable insights\n* Demonstrated interest for helping build great businesses and for Meta products\n\n\n About Meta:\n   \n\n  \n\n Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics.\n   \n\n  \n\n Meta is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Meta participates in the E\\-Verify program in certain locations, as required by law. Please note that Meta may leverage artificial intelligence and machine learning technologies in connection with applications for employment.\n   \n\n  \n\n Meta is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations\\-ext@fb.com.\n   \n\n  \n\n $126,000/year to $178,000/year \\+ bonus \\+ equity \\+ benefits\n   \n\n  \n\n Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta.",
    "keywords": [
      "Sales Strategic Planning",
      "Operations",
      "Revenue Growth",
      "Product Adoption",
      "Data-driven",
      "Business Strategy",
      "Process Optimization",
      "Stakeholder Management",
      "Cross-functional Leadership",
      "GTM (Go-to-Market)",
      "Change Management",
      "Program Management",
      "SQL",
      "Management Consulting",
      "Product Management",
      "Enterprise SaaS",
      "Sales Operations",
      "Quantitative Analysis",
      "Technology Industry",
      "Meta"
    ]
  },
  {
    "id": "li-4277572000",
    "title": "Manager, Strategic Finance - LinkedIn Marketing Solutions",
    "company": "LinkedIn",
    "location": "Mountain View, CA",
    "description": "**Company Description**\n LinkedIn is the world’s largest professional network, built to create economic opportunity for every member of the global workforce. Our products help people make powerful connections, discover exciting opportunities, build necessary skills, and gain valuable insights every day. We’re also committed to providing transformational opportunities for our own employees by investing in their growth. We aspire to create a culture that’s built on trust, care, inclusion, and fun – where everyone can succeed.\n   \n\n  \n\n Join us to transform the way the world works.\n   \n\n  \n\n**Job Description**\n At LinkedIn, our approach to flexible work is centered on trust and optimized for culture, connection, clarity, and the evolving needs of our business. The work location of this role is hybrid, meaning it will be performed both from home and from a LinkedIn office on select days, as determined by the business needs of the team.\n   \n\n  \n\n This role will be based in Mountain View, San Francisco Bay Area, or New York.\n   \n\n  \n\n We are looking for a strategic, data\\-driven leader with deep analytical expertise to join our Strategic Finance team as a Manager supporting LinkedIn's Marketing Solutions business (LMS). In this new role, you will primarily lead our Data Science partnership, focused on enhancing our ads marketplace understanding through sophisticated frameworks and analyses. You’ll help the team better answer critical questions like:\n *How does engagement drive monetization?* \n*How do ROI improvements impact revenue?* \n*What is the incremental value of product adoption?* \n You’ll also develop frameworks to measure incrementality, forecast and explain metric variances, and ensure teams are accountable for achieving their goals.\n   \n\n  \n\n Additionally, you will lead our R\\&D Portfolio Allocation efforts \\- tracking, analyzing, and providing recommendations on our investment portfolio across the LMS business. You'll develop frameworks to evaluate investment ROI, provide visibility into resource allocation, and connect portfolio decisions to our long\\-range planning. You'll collaborate with R\\&D leadership while influencing cross\\-functional stakeholders to drive strategic decisions through data\\-backed insights. We're seeking someone who can confidently share and challenge points of view with senior stakeholders, engage deeply with technical partners on complex data projects, and effectively translate between technical and business contexts. You'll develop executive\\-ready narratives that shape investment priorities and growth strategies while maintaining credibility across both Data Science and business teams. The ideal candidate combines exceptional analytical rigor, strategic vision, technical curiosity, and excellent stakeholder management skills to help accelerate sustainable growth for LinkedIn's ads business.\n   \n\n  \n\n Responsibilities:\n   \n\n  \n\n Strategic Thinking:\n   \n\n  \n\n* Begins to identify new opportunities for growth within a limited scope and leads strategy development with business partners.\n* Validates and executes complex pressure testing of growth opportunities.\n* Provides guidance and support to more junior team members learning to operationalizes ideas and develop plans for execution.\n* Maintains collaborative relationships with other teams and proactively seeks input and feedback to develop an understanding of their priorities and constraints.\n\n\n Stakeholder Influence:\n   \n\n  \n\n* Communicates implications of work (e.g., forecasts, analyses, trends) and implications of internal/external factors to management and cross\\-functional stakeholders to drive action.\n* Leverages insights and data to develop narratives to influence stakeholders.\n* Synthesizes problems and communicates point of view to drive alignment and decision\\-making on issues within area of responsibility.\n\n\n Execution \\& Organization\n   \n\n  \n\n* Independently partners with cross\\-functional stakeholders to support the growth of initiatives by providing a metrics\\-oriented perspective.\n* Serves as a resource for stakeholders to answer a wide variety of complex questions.\n* Independently drives the development of large workstreams, projects, or operational processes.\n* Proactively identifies obstacles and recommends solutions.\n\n\n Performance Management\n   \n\n  \n\n* Supports performance management by creating, maintaining, and updating complex models and forecasts and develops improvements/alternatives for key metrics.\n* Provides informal coaching and mentorship to junior team members working to forecast and analyze risks and opportunities in meeting targets.\n* Leverages highly advanced knowledge to develop hypotheses using identified signals, trends, and risks.\n* Executes ad hoc analyses to prove/disprove hypotheses and address highly complex business questions, deriving actionable insights from results.\n* Partners with cross\\-functional teams to design experiments to close deviations from targets.\n\n\n Culture \\& Values\n   \n\n  \n\n* Works as part of a team that supports the culture and values of the organization, including people development and diversity, inclusion, and belonging.\n* Provides actionable, concrete project\\-oriented feedback (after a meeting, end\\-of\\-project review) to colleagues and/or partners.\n* Seeks out new opportunities for career growth and skill development and shares with others.\n\n\n**Qualifications**\n Basic Qualifications:\n   \n\n  \n\n* Bachelor's Degree in Business, Business Analytics, Finance, or related field AND minimum 5 years of experience in finance, finance accounting, management consulting, investment banking, or related field OR equivalent experience.\n\n\n Preferred Qualifications:\n   \n\n  \n\n* 3\\+ years of experience in the technology industry.\n* 1\\+ years of data analytics or statistics experience\n\n\n Suggested Skills:\n   \n\n  \n\n* Strategic Thinking\n* Cross\\-Team Collaboration\n* Data Analysis\n* Project Management\n\n\n LinkedIn is committed to fair and equitable compensation practices. The pay range for this role is $123,000 to $199,000\\. Actual compensation packages are based on several factors that are unique to each candidate, including but not limited to skill set, depth of experience, certifications, and specific office location. This may be different in other locations due to differences in the cost of labor.\n   \n\n  \n\n The total compensation package for this position may also include annual performance bonus, stock, benefits and/or other applicable incentive compensation plans. For more information, visit https://careers.linkedin.com/benefits.\n   \n\n  \n\n**Additional Information**\n**Equal Opportunity Statement**\n We seek candidates with a wide range of perspectives and backgrounds and we are proud to be an equal opportunity employer. LinkedIn considers qualified applicants without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, marital status, pregnancy, sex, gender expression or identity, sexual orientation, citizenship, or any other legally protected class.\n   \n\n  \n\n LinkedIn is committed to offering an inclusive and accessible experience for all job seekers, including individuals with disabilities. Our goal is to foster an inclusive and accessible workplace where everyone has the opportunity to be successful.\n   \n\n  \n\n If you need a reasonable accommodation to search for a job opening, apply for a position, or participate in the interview process, connect with us at accommodations@linkedin.com and describe the specific accommodation requested for a disability\\-related limitation.\n   \n\n  \n\n Reasonable accommodations are modifications or adjustments to the application or hiring process that would enable you to fully participate in that process. Examples of reasonable accommodations include but are not limited to:\n   \n\n  \n\n* Documents in alternate formats or read aloud to you\n* Having interviews in an accessible location\n* Being accompanied by a service dog\n* Having a sign language interpreter present for the interview\n\n\n A request for an accommodation will be responded to within three business days. However, non\\-disability related requests, such as following up on an application, will not receive a response.\n   \n\n  \n\n LinkedIn will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by LinkedIn, or (c) consistent with LinkedIn's legal duty to furnish information.\n   \n\n  \n\n**San Francisco Fair Chance Ordinance**\n Pursuant to the San Francisco Fair Chance Ordinance, LinkedIn will consider for employment qualified applicants with arrest and conviction records.\n   \n\n  \n\n**Pay Transparency Policy Statement**\n As a federal contractor, LinkedIn follows the Pay Transparency and non\\-discrimination provisions described at this link: https://lnkd.in/paytransparency.\n   \n\n  \n\n**Global Data Privacy Notice for Job Candidates**\n Please follow this link to access the document that provides transparency around the way in which LinkedIn handles personal data of employees and job applicants: https://legal.linkedin.com/candidate\\-portal.",
    "keywords": [
      "Manager",
      "Strategic Finance",
      "Marketing Solutions",
      "data-driven",
      "analytical expertise",
      "Data Science",
      "ads marketplace",
      "engagement",
      "monetization",
      "ROI",
      "revenue",
      "incrementality",
      "forecast",
      "R&D Portfolio",
      "investment",
      "stakeholder management",
      "cross-functional",
      "Bachelor's Degree",
      "finance experience",
      "technology industry",
      "strategic thinking"
    ]
  },
  {
    "id": "li-4300558209",
    "title": "Airport Security Specialist",
    "company": "County of Volusia",
    "location": "DeLand, FL",
    "description": "Major Functions\n   \n\n  \n\n NOTE: THIS IS A CONTRACTED POSITION, LOCATED AT THE DAYTONA BEACHINTERNATIONAL AIRPORT. THE SELECTED CANDIDATE(S) WILL BE EMPLOYED\n   \n\n  \n\n THROUGH A THIRD PARTY VENDOR AND INELIGIBLE FOR COUNTY OFFEREDBENEFITS.\n   \n\n  \n\n Pre Employment Requirements\n   \n\n  \n\n Selected candidates will need to complete an application for employment, Airport IDapplication, submit fingerprints and driver's license for a full Criminal HistoryRecords Check (CHRC) and driver's license validation. Applicants must successfullypass a drug test and all other background checks. The application and screeningprocess may take between two (2\\) and three (3\\) weeks to complete pending theresults of background checks and screening.\n   \n\n  \n\n Major Functions\n   \n\n  \n\n The Airport Security Specialist is an integral member of the Airport's Security Team and essential to the efficient day to day operation of the Airport Security Department. The Airport Security Specialist position is multifunctional, encompassing the Curbside, Ground Transportation and Airport Control areas. The preferred candidate is team orientated, selfmotived and displays a friendly customer service attitude.\n   \n\n  \n\n NOTE: The position is considered Airport Essential during emergencies and severeweather conditions, and requires 24/7 shift work to include nights, weekends,holidays and before, during and after severe weather conditions.\n   \n\n  \n\n For employment consideration, please forward a resume to Josh Raver at jraver@flydab.com. Candidates selected for an interview will be contacted by email and/or telephone.\n   \n\n  \n\n NOTE: Applications are not being accepted atwww.volusia.org.\n   \n\n  \n\n* This position is posted on a continuous basis and may close without notice.\\*\n\n\n Illustrative Duties\n   \n\n  \n\n NOTE: These are intended only as illustrations of the various types of work performed. The omission of specific duties does not exclude them from the position.)\n   \n\n  \n\n* Reports and responds to emergency and non?emergency situations includingbut not limited to fires, vandalism, theft, illegal entry, suspicious activity, etc.\n* Communicates and coordinates information or instructions clearly andeffectively with law enforcement, emergency responders, and Airport tenantsvia two\\-way radios, telephones, and in person briefings.\n* Monitors Airport security video surveillance, fire protection, and radiocommunications systems.\n* Monitors use of computer data files to safeguard information; follows up onany violations with appropriate personnel.\n* Monitors for activities which violate Airport safety and security regulationsand could result in injury to guests/employees or damage to Airportproperty.\n* Serves as a visible deterrent to crime and suspicious or prohibited activitiesin public and non?public areas located on Airport property.\n* Conducts both random and scheduled security sweeps and inspections asinstructed by the Airport Security Coordinator.\n* Controls traffic flow along the entrance of the Airport terminal.\n* Monitors employee, short and long term parking lots.\n* Ensures vehicles entering secured areas are authorized.\n* Performs safety inspections, collects fees and issues permits andidentification badges to taxis and other ground transportation providers.\n* Maintains a positive and friendly working relationship with Airport tenantsand guests while implementing the Airport's Security Program.\n* Assists customers by providing general Airport information, such as parkingand lost and found information.\n* Provides escorts for contractors, guests, and Airport users.\n* Records test results, test procedures, or inspection data and verifiescompleteness or accuracy of data.\n* Transcribes spoken and written information and prepares reports.\n* Monitors Airport operational conditions and status of automated systems,performing routine tests to ensure appropriate notifications and follow up\n\n\n actions are taken. \\* Provides Airport staff, tenants and users with operational conditions,information, directions and assistance through various communications andcomputer systems to ensure the safe, secure and expeditious movement ofthe traveling public. \\* Coordinates and dispatches appropriate staff regarding operational,maintenance, safety and security related issues; logs and reports complaints(i.e., noise, shuttle, etc.) to staff for appropriate follow\\-up. \\* Maintains surveillance to ensure security system is operational and monitorssecurity system activities for discrepancies, and dispatches appropriate staffas required. \\* Monitors all automated equipment systems for fire, security and maintenance\n   \n\n  \n\n alarms, making appropriate notifications when necessary \\* Initiates and coordinates Airport response and notification of essential local,state and federal agencies to respond to emergencies in support of the\"Unified Incident Command\" structure; assists with operation of the AirportOperations Center as required. \\* Monitors communication center equipment, reports equipment problems;records all significant events disseminated to and/or from thecommunications center daily in computerized logs. \\* May operate motor vehicles to tow trailers or to transport employees and/or the general public. \\* May conduct airfield tours. \\* Performs other duties as assigned.\n   \n\n  \n\n**Minimum Requirements**\n Minimum Qualifications\n   \n\n  \n\n* Must be at least 18 years of age or older, eligible to work in the UnitedStates, and possess a high school diploma or equivalent.\n* Must pass a criminal history record check and security threat assessment.\n* Must pass a drug screening.\n* Must possess and maintain a valid Florida driver's license during\n\n\n employment. \\* Must have one year of Airport, security or communications center\n   \n\n  \n\n experience. \\* Must pass a computer skills test (accurately type 15?20 words per minute)\n   \n\n  \n\n and have basic/Intermediate experience using Microsoft Office (Word, Excel, and PowerPoint).\n   \n\n  \n\n Having met the minimum qualifications, the preferred candidatewill have priormilitary, aviation, security, law enforcement or communications experience.\n   \n\n  \n\n Licenses and Certifications Required\n   \n\n  \n\n* Obtain or possess a valid Florida Driver's License upon initial performance ofduties.\n* Obtain Airport Perimeter Service Road/Non?Movement Area drivercertification/endorsement within ten (10\\) days of initial performance ofduties.\n* Obtain Airport Airfield Ground Vehicle Operator driver certification /endorsement within (6\\) months of initial performance of duties.\n* Ability to obtain and maintain a Security Identification Display Area (SIDA)Badge.\n\n\n NOTE: THIS IS A CONTRACTED POSITION, LOCATED AT THE DAYTONA BEACHINTERNATIONAL AIRPORT. THE SELECTED CANDIDATE(S) WILL BE EMPLOYED\n   \n\n  \n\n THROUGH A THIRD PARTY VENDOR AND INELIGIBLE FOR COUNTY OFFEREDBENEFITS.\n   \n\n  \n\n For employment consideration, please forward a resume to Josh Raver at jraver@flydab.com. Candidates selected for an interview will be contacted by email and/or telephone.\n   \n\n  \n\n NOTE: Applications are not being accepted atwww.volusia.org.\n   \n\n  \n\n**Knowledge, Skills \\& Abilities**\n* Operational working knowledge of closed circuit television systems.\n* Operational working knowledge of airport control/communication center.\n* Skilled in oral and written communications.\n* Skilled in prioritizing and multitasking.\n* Skilled in using computers, faxes, office equipment and related software (MSOffice ? Word, Excel, PowerPoint and Access).\n* Skilled in planning and organizing.\n* Able to understand English for aviation communications.\n* Able to deal with customers and provide customer service.\n* Able to work with frequent interruptions and changes in priorities.\n* Able to use base station and handheld radio communication devices.\n* Able to facilitate training, conduct briefings and provide feedback.\n* Able to recognize public safety hazards.\n* Able to understand and take ownership of assigned tasks.\n\n\n Equipment Utilized\n   \n\n  \n\n* Golf carts\n* 14 passenger shuttle cart\n* 14 passenger bus\n* Radio base station, transmitter and receiver\n* Hand?held radio communication devices.\n\n\n ADA Requirements\n   \n\n  \n\n Physical Demands: Ability to speak and possess hearing acuity necessary tounderstand radio communications. Visual acuity (peripheral vision, depthperception, color acuity) necessary to operate motorized and special use vehicles,and recognize airport badges, airfield lights, and emergency vehicle lights. Able tolift and carry, push, pull, up to 50 pounds unassisted; stand, walk, climb, reach,handle, finger dexterity.\n   \n\n  \n\n Environmental Demands: Inside and outside work. May require exposure toinclement weather (heat, humidity, wind, cold, and rain), hazardous conditions,chemicals, insects, odors, dust, fumes, noise, confined spaces and poor ventilation.\n   \n\n  \n\n Mental Demands:Able to speak, write, read and comprehend English. Able to readreports, safety instructions, memos, and letters. Ability to understand instructions, directions, procedures, memos and reports. Ability to perform basic math andarithmetic. Ability to understand and speak clearly and concisely to relayinformation to other workers and laymen. Ability to identify and resolve problems.Ability to analyze data and develop conclusions.\n   \n\n  \n\n Volusia County is a drug free workplace and an Equal Opportunity Employer committed to a diverse workforce.",
    "keywords": [
      "Airport Security",
      "Security Specialist",
      "Emergency Response",
      "Surveillance Systems",
      "Radio Communications",
      "Criminal History Check",
      "Drug Screening",
      "Florida Driver's License",
      "SIDA Badge",
      "Customer Service",
      "Microsoft Office",
      "Aviation Experience",
      "Law Enforcement",
      "Security Clearance",
      "Airfield Operations",
      "Traffic Control",
      "Ground Transportation",
      "24/7 Shifts",
      "Security Inspections",
      "Team Oriented"
    ]
  },
  {
    "id": "li-4300293688",
    "title": "Paralegal",
    "company": "Tenstorrent",
    "location": "Boston, MA",
    "description": "Tenstorrent is leading the industry on cutting\\-edge AI technology, revolutionizing performance expectations, ease of use, and cost efficiency. With AI redefining the computing paradigm, solutions must evolve to unify innovations in software models, compilers, platforms, networking, and semiconductors. Our diverse team of technologists have developed a high performance RISC\\-V CPU from scratch, and share a passion for AI and a deep desire to build the best AI platform possible. We value collaboration, curiosity, and a commitment to solving hard problems. We are growing our team and looking for contributors of all seniorities.\n   \n\n  \n\n We're building breakthrough AI hardware, and we need someone who can help keep the legal side just as sharp. As our Paralegal, you'll be the connective tissue between our legal team, business leaders, and external counsel\\-making sure contracts, filings, and compliance run smoothly while the company scales. This is a hands\\-on role at the intersection of law, operations, and innovation.\n   \n\n  \n\n This role is hybrid, based out of Austin, TX, Boston, MA, or Santa Clara, CA.\n   \n\n  \n\n We welcome candidates at various experience levels for this role. During the interview process, candidates will be assessed for the appropriate level, and offers will align with that level, which may differ from the one in this posting.\n   \n\n  \n\n Who You Are\n   \n\n  \n\n* Skilled at organizing and managing legal documents with an eagle eye for detail.\n* Comfortable working in a fast\\-moving environment where priorities shift and speed matters.\n* Strong communicator who can translate legal concepts into practical business terms.\n* Proactive, resourceful, and able to manage multiple work streams without losing focus.\n\n\n What We Need\n   \n\n  \n\n* Support for contracts lifecycle: drafting templates, reviewing agreements, tracking approvals, and maintaining contract databases.\n* Assistance with corporate governance, board materials, equity documentation, and regulatory filings.\n* Coordination with outside counsel on IP, employment, and commercial matters.\n* Research and preparation of legal memos on emerging issues relevant to AI, hardware, and global operations.\n* Negotiate contracts and NDAs using our internal playbook.\n\n\n What You Will Learn\n   \n\n  \n\n* How cutting\\-edge AI hardware companies structure deals, partnerships, and operations.\n* The legal frameworks shaping AI, data use, and emerging technologies.\n* Cross\\-functional collaboration with engineering, operations, finance, and leadership teams.\n* How to build scalable legal processes inside a high\\-growth startup.\n\n\n Compensation for all engineers at Tenstorrent ranges from $100k \\- $500k including base and variable compensation targets. Experience, skills, education, background and location all impact the actual offer made.\n   \n\n  \n\n Tenstorrent offers a highly competitive compensation package and benefits, and we are an equal opportunity employer.\n   \n\n  \n\n This offer of employment is contingent upon the applicant being eligible to access U.S. export\\-controlled technology. Due to U.S. export laws, including those codified in the U.S. Export Administration Regulations (EAR), the Company is required to ensure compliance with these laws when transferring technology to nationals of certain countries (such as EAR Country Groups D:1, E1, and E2\\). These requirements apply to persons located in the U.S. and all countries outside the U.S. As the position offered will have direct and/or indirect access to information, systems, or technologies subject to these laws, the offer may be contingent upon your citizenship/permanent residency status or ability to obtain prior license approval from the U.S. Commerce Department or applicable federal agency. If employment is not possible due to U.S. export laws, any offer of employment will be rescinded.",
    "keywords": [
      "Paralegal",
      "legal documents",
      "contracts",
      "corporate governance",
      "compliance",
      "NDAs",
      "IP",
      "regulatory filings",
      "contract negotiation",
      "legal research",
      "outside counsel",
      "AI technology",
      "hardware",
      "startup",
      "cross-functional collaboration",
      "export control",
      "legal frameworks",
      "contract lifecycle",
      "board materials",
      "equity documentation"
    ]
  },
  {
    "id": "li-4285035138",
    "title": "Administrative Assistant II - Human Resources",
    "company": "Frost",
    "location": "San Antonio, TX",
    "description": "**Job Description**\n***It’s about supporting people, our people.***\n Are you known as an organized individual? Do you enjoy working independently and with a team? Do you find yourself creating a task list daily? If so, then the Administrative Assistant II role may be right for you!\n   \n\n  \n\n At Frost, it’s about more than a job. It’s about having a flourishing career where you can thrive, both in and out of work. At Frost, we’re committed to fostering an environment that reflects our values and encourages team members to be the best they can be. In joining our adaptable, integrity\\-driven team, you’ll become part of Frost’s 155\\-year legacy of providing unparalleled banking services.\n   \n\n  \n\n**Who You Are**\n As an\n **Administrative Assistant II** \n ,\n *you* \n provide support to managers and other employees by handling a variety of tasks to ensure that all interactions between the organization and others are positive and efficient. You enjoy working cross\\-functionally with other lines of business in the organization and you take this as an opportunity to build long lasting relationships with all individuals in the organization. You have the ability to prioritize projects, resolve problems, and pay attention to detail. Most importantly, this role is about building trust through every interaction and doing it with integrity, caring and excellence in mind.\n   \n\n  \n\n**What You’ll Do**\n* Independently perform administrative work specific to the established department processes\n* Work cross functionally with multiple lines of business to appropriately escalate issues and inquiries\n* Rely on detailed knowledge of department procedures to accurately perform reconciliation duties\n* Provide calculated data to your team in an easily digestible way upon request\n* Always take action using Integrity, Caring, and Excellence to achieve all\\-win outcomes\n\n\n**What You’ll Need**\n* Demonstrated attention to detail\n* Working knowledge of business specific programs and applications\n* Strong organizational skills\n* Exceptional customer service skills\n* Excellent written and verbal communication skills\n* Proficiency in Microsoft applications.\n\n\n**Our Benefits**\n At Frost, we care about your health, your family, and your future and strive to have our benefits reflect that. This includes:\n   \n\n  \n\n* Medical, dental, vision, long\\-term disability, and life insurance\n* 401(k) matching\n* Generous holiday and paid time off schedule\n* Tuition reimbursement\n* Extensive health and wellness programs, including our Employee Assistance Program\n* Referral bonus program \\+ more!\n\n\n Since 1868, Frost has dedicated their expertise to provide exceptional banking, investment, and insurance services to businesses and individuals throughout Texas. Frost is one of the 50 largest U.S. banks by asset size and is a leader in banking customer satisfaction. At Frost, it’s about being part of something bigger. If this sounds like you, we encourage you to apply and see what’s possible at Frost.",
    "keywords": [
      "Administrative Assistant",
      "Human Resources",
      "organized",
      "independent",
      "team",
      "support",
      "managers",
      "cross-functional",
      "prioritize",
      "detail-oriented",
      "integrity",
      "reconciliation",
      "customer service",
      "communication skills",
      "Microsoft applications",
      "organizational skills",
      "problem-solving",
      "banking",
      "business processes",
      "data analysis"
    ]
  },
  {
    "id": "li-4300555411",
    "title": "Desk Assistant",
    "company": "Paramount+",
    "location": "New York, NY",
    "description": "**Desk Assistant, CBS NEW YORK (Freelance)**\n**Desk Assistant (Freelance)**\n CBS New York is looking for a journalist who wants to grow their news\\-gathering skills at the \\#1 television station in the portfolio of Paramount owned stations. Join a team with tremendous opportunity for career growth and development!\n   \n\n  \n\n**Key Responsibilities**\n* Work closely with assignment editors, reporters, and producers in development of daily news coverage.\n* Make regular calls to a wide range of local agencies to confirm information.\n* Set up and conduct interviews.\n* Assist with editorial research and fact\\-checking.\n* Communicate information to the newsroom in a timely fashion.\n* Answer phones, emails and vet information and tips.\n* Log interviews and press conferences.\n* Shadow assignment editors with opportunities to run the desk as acting assignment editor\n\n\n**Required Skills**\n* Must be a clear and courteous communicator.\n* Must understand deadlines and be comfortable in a fast\\-paced environment.\n* Must be a team player who likes to collaborate.\n* Must have experience leveraging social media to track down information.\n* Bachelor's Degree in journalism or a related field.\n* Must be willing to work evenings, overnight, weekends, and holidays.\n\n\n CBS News and Stations, brings together the power of CBS News, 28 owned television stations in 17 major U.S. markets, the CBS News Streaming Network, CBS News Streaming local platforms, local websites and cbsnews.com, under one umbrella. CBS News and Stations is home to the nations \\#1 news program 60 MINUTES, the CBS News Streaming Network, the first 24/7 digital streaming news network, the award\\-winning broadcasts CBS MORNINGS, CBS SATURDAY MORNING, the CBS EVENING NEWS, CBS SUNDAY MORNING, CBS WEEKEND EVENING NEWS, 48 HOURS and FACE THE NATION WITH MARGARET BRENNAN. CBS News and Stations provides news and information for the CBS Television Network, CBSNews.com, CBS News Radio and podcasts, Paramount \\+, all digital platforms, and the CBS News Streaming Network, the premier 24/7 anchored streaming news service that is available free to everyone with access to the internet. The CBS News Streaming Network is the destination for breaking news, live events, original reporting and storytelling, and programs from CBS News and Stations top anchors and correspondents working locally, nationally and around the globe. CBS News streaming services, across national and local, amassed more than 1\\.01 billion streams in 2021\\. Launched in November 2014 as CBSN, the CBS News Streaming Network is available on 30 digital platforms and apps, as well as CBSNews.com and Paramount\\+. The service is available live in 91 countries. CBS News and Stations is dedicated to providing the highest quality journalism under standards it pioneered and continues to set in todays digital age. CBS News earns more prestigious journalism awards than any other broadcast news division.\n   \n\n  \n\n Organizations that wish to receive job vacancy notices from this postings television station should contact sf\\_recruitingsupport@paramount.com.\n   \n\n  \n\n**Additional Information**\n Hiring Salary Range: $25\\.0 \\- 25\\.0\\.\n   \n\n  \n\n The hiring salary range for this position applies to New York City, California, Colorado, Washington state, and most other geographies. Starting pay for the successful applicant depends on a variety of job\\-related factors, including but not limited to geographic location, market demands, experience, training, and education.\n   \n\n  \n\n https://www.paramount.com/careers/benefits\n   \n\n  \n\n Paramount is an equal opportunity employer (EOE) including disability/vet.\n   \n\n  \n\n At Paramount, the spirit of inclusion feeds into everything that we do, on\\-screen and off. From the programming and movies we create to employee benefits/programs and social impact outreach initiatives, we believe that opportunity, access, resources and rewards should be available to and for the benefit of all. Paramount is proud to be an equal opportunity workplace. We are committed to equal employment opportunity regardless of race, color, ethnicity, ancestry, religion, creed, sex, national origin, sexual orientation, age, citizenship status, marital status, disability, gender identity, gender expression, and Veteran status.\n   \n\n  \n\n If you are a qualified individual with a disability or a disabled veteran, you may request a reasonable accommodation if you are unable or limited in your ability to use or access https://www.paramount.com/careers as a result of your disability. You can request reasonable accommodations by calling 212\\.846\\.5500 or by sending an email to paramountaccommodations@paramount.com. Only messages left for this purpose will be returned.",
    "keywords": [
      "Desk Assistant",
      "CBS New York",
      "journalist",
      "freelance",
      "assignment editors",
      "reporters",
      "producers",
      "news coverage",
      "interviews",
      "editorial research",
      "fact-checking",
      "newsroom",
      "social media",
      "Bachelor's Degree",
      "journalism",
      "fast-paced environment",
      "team player",
      "deadlines",
      "communication",
      "television station"
    ]
  },
  {
    "id": "li-4300560196",
    "title": "Press Secretary UN",
    "company": "City of Albuquerque",
    "location": "Albuquerque, NM",
    "description": "Position Summary\n   \n\n  \n\n This position reports directly to the Communications Director and the Office of the Chief of Staff. This role will develop, implement, maintain, and disseminate an effective public information program for the Mayor's Office and the City of Albuquerque; serve as media liaison and spokesperson; write and edit news releases, memorandums, prepare speech materials, newsletters, flyers; organize and attend public meetings; assist with website management and all social media platforms; special events; and assist with other internal and external communications or related tasks as needed.\n   \n\n  \n\n Actively manage public information officers to develop long term plans and address issues that arise. Gather, develop and coordinate items from departments and incorporate items into planning with the Communications Director and the Office of the Chief of Staff. Coordinate communications with internal divisions and maintain relationships with media.\n   \n\n  \n\n This is an unclassified at\\-will position.\n   \n\n  \n\n Job descriptions are intended to present a general list of tasks/duties performed by employees within this job classification. Job Descriptions are not intended to reflect all duties performed within the job.\n   \n\n  \n\n**Minimum Education, Experience And Additional Requirements**\n Bachelor's degree from an accredited college or university in communications, political science, public policy, public administration, or a related field preferred; and\n   \n\n  \n\n Eight (8\\) years of experience with increasing responsibilities in media communications and/or public relations preferred; and\n   \n\n  \n\n**Supervisory Experience Preferred.**\n ADDITIONAL REQUIREMENTS\n   \n\n  \n\n Possession of a valid New Mexico Driver's License, or the ability to obtain by date of hire.\n   \n\n  \n\n Possession of a City Operator's Permit (COP) within 6 months from date of hire.\n   \n\n  \n\n**Preferred Knowledge**\n* Principles and practices of mass communication including experience with print, radio, television, and social media platforms\n* Principles of project management\n* Municipal government operations\n* Microsoft Office and social media platforms\n\n\n**Preferred Skills \\& Abilities**\n* Exercise good judgement and attention to detail\n* Work independently taking responsibility for self and workload\n* Plan, manage and meet project deadlines\n* Analyze and assess programs, policies and operational needs and make appropriate adjustments\n* Identify and respond to sensitive community and organizational issues, concerns and needs\n* Communicate clearly and assertively\n* Establish and maintain effective working relationships with those contacted in the course of work\n* Perform the essential functions of the job with or without reasonable accommodation",
    "keywords": [
      "Based on this job description for Press Secretary",
      "here are the most important keywords:\n\nPress Secretary",
      "Communications Director",
      "Mayor's Office",
      "media liaison",
      "spokesperson",
      "news releases",
      "speech materials",
      "public meetings",
      "website management",
      "social media platforms",
      "public information",
      "media communications",
      "public relations",
      "mass communication",
      "print media",
      "radio",
      "television",
      "municipal government",
      "project management",
      "Microsoft Office"
    ]
  },
  {
    "id": "li-4191146990",
    "site": "linkedin",
    "job_url": "https://www.linkedin.com/jobs/view/4191146990",
    "job_url_direct": "https://nuro.ai/careersitem?gh_jid=6447851&gh_src=bcd22a501us&urlHash=KRMM",
    "title": "Software Engineer, AI Platform - New Grad",
    "company": "Nuro",
    "location": "Mountain View, CA",
    "date_posted": 1757721600000,
    "job_type": "fulltime",
    "salary_source": null,
    "interval": null,
    "min_amount": null,
    "max_amount": null,
    "currency": null,
    "is_remote": false,
    "job_level": "internship",
    "job_function": "Engineering and Information Technology",
    "listing_type": null,
    "emails": null,
    "description": "**Who We Are**\n Nuro is a self\\-driving technology company on a mission to make autonomy accessible to all. Founded in 2016, Nuro is building the world’s most scalable driver, combining cutting\\-edge AI with automotive\\-grade hardware. Nuro licenses its core technology, the Nuro Driver™, to support a wide range of applications, from robotaxis and commercial fleets to personally owned vehicles. With technology proven over years of self\\-driving deployments, Nuro gives the automakers and mobility platforms a clear path to AVs at commercial scale—empowering a safer, richer, and more connected future.\n   \n\n  \n\n**About The Role**\n Our software team is growing, and we are looking for talented engineers who are graduating by July 2025 to join us and be instrumental to one of the following areas: Data Platform, Onboard Systems, ML Infrastructure, Simulation, or Technical Infrastructure teams.\n   \n\n  \n\n**About The Work**\n Depending on your skill set and areas of interest you will work on some or all of the following:\n   \n\n  \n\n* Data Platform: The Data Platform serves as a comprehensive management system for Nuro AI Driver's data, labels, and metrics, facilitating seamless access functionality. The team focuses on data annotation across various domains, including 2D/3D perception, mapping, behavior trajectory, and language/text. It also handles data ingestion and mining, employing methods such as heuristics and embedding search. Additionally, the platform supports the autonomy evaluation infrastructure by providing detailed introspection.\n* Onboard Systems: Our onboard system team’s software engineers provide a reliable and high\\-performance platform that allows our autonomy teams to integrate their autonomy software and algorithms that work across various self\\-driving platforms. This work requires close collaboration with our software teams, hardware teams, and systems/safety team to make sure new software and hardware work together safely and reliably and resolve onboard error and performance problems.\n* Technical Infrastructure: this group owns few fundamental services for entire engineering organizations: generic compute platform to host mission\\-critical workflows such as data processing and simulation, storage management service which manages hundreds of PB of data, cloud infrastructure serves as IaaC which provisions and maintains all cloud resources, engineering productivity provides tools such as build and CI/CD to make engineering work more efficient.\n\n\n**About You**\n You have deep expertise and prior experience in some or many of the following areas:\n   \n\n  \n\n* You are a current Bachelor’s Degree or Master’s Degree candidate in Computer Science, Electrical Engineering, Robotics, or related field, graduating before July 2025\\.\n* You have experience in one or more of the following areas: large\\-scale distributed systems; data storage and processing systems; advanced algorithms using C\\+\\+ and Python; machine learning, multithreading; x86 architecture; and software performance tuning and optimization, robotics software frameworks, different compute modalities (CPU, GPU, FPGA) etc.\n* You have strong problem\\-solving and programming skills.\n\n\n At Nuro, your base pay is one part of your total compensation package. For this position, the reasonably expected base pay range is between $145,000 and $170,000 for the level at which this job has been scoped. Your base pay will depend on several factors, including your experience, qualifications, education, location, and skills. In the event that you are considered for a different level, a higher or lower pay range would apply. This position is also eligible for an annual performance bonus, equity, and a competitive benefits package\n   \n\n  \n\n*At Nuro, we celebrate differences and are committed to a diverse workplace that fosters inclusion and psychological safety for all employees. Nuro is proud to be an equal opportunity employer and expressly prohibits any form of workplace discrimination based on race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, genetic information, disability, veteran status, or any other legally protected characteristics.*",
    "company_industry": "Software Development",
    "company_url": "https://www.linkedin.com/company/nuro-inc.",
    "company_logo": "https://media.licdn.com/dms/image/v2/C560BAQHahNycmNp6Gg/company-logo_100_100/company-logo_100_100/0/1630638403898/nuro_inc_logo?e=2147483647&v=beta&t=3FVrqvduIGtnaH7-fVEnLalZbqxzzCLA1ALuQ76cgmc",
    "company_url_direct": null,
    "company_addresses": null,
    "company_num_employees": null,
    "company_revenue": null,
    "company_description": null,
    "skills": null,
    "experience_range": null,
    "company_rating": null,
    "company_reviews_count": null,
    "vacancy_count": null,
    "work_from_home_type": null,
    "keywords": [
      "Software Engineer",
      "AI Platform",
      "New Grad",
      "Computer Science",
      "Electrical Engineering",
      "Robotics",
      "C++",
      "Python",
      "Machine Learning",
      "Data Platform",
      "Onboard Systems",
      "ML Infrastructure",
      "Simulation",
      "Technical Infrastructure",
      "Distributed Systems",
      "Data Storage",
      "Data Processing",
      "Self-driving",
      "Autonomy",
      "Bachelor's Degree"
    ]
  },
  {
    "id": "li-4098166100",
    "site": "linkedin",
    "job_url": "https://www.linkedin.com/jobs/view/4098166100",
    "job_url_direct": "https://jobs.ashbyhq.com/zip/0c1b3417-9ba4-4630-8590-f6b45c40310a&urlHash=F4qN",
    "title": "Software Engineer, Frontend (All Levels)",
    "company": "Zip",
    "location": "San Francisco, CA",
    "date_posted": 1757721600000,
    "job_type": "fulltime",
    "salary_source": null,
    "interval": null,
    "min_amount": null,
    "max_amount": null,
    "currency": null,
    "is_remote": false,
    "job_level": "mid-senior level",
    "job_function": "Engineering and Information Technology",
    "listing_type": null,
    "emails": null,
    "description": "The simple task of buying software, services, or tools at work has become hopelessly complicated at even the most innovative companies in the world. Today, enterprises spend $120T\\+ per year globally (\\>30 times larger than annual consumer e\\-commerce spend) and rely on vendors more than ever before to run their businesses.\n   \n\n  \n\n Our cofounders started Zip in 2020 to address this seemingly intractable problem with a purpose\\-built procurement platform that provides a simple, consumer\\-grade user experience. Within the last 4 years, Zip has created a new category and developed the leading solution in this $50B\\+ TAM space. Today, the world’s leading companies like OpenAI, Snowflake, Anthropic, Coinbase, and Prudential rely on Zip to manage billions of dollars in spend.\n   \n\n  \n\n We have a world\\-class team coming from category\\-defining companies like Airbnb, Meta, Stripe, Salesforce, Apple, and Google. With a $2\\.2 billion valuation and $370 million in funding from Y Combinator, Tiger Global, BOND, DST Global, and CRV, we’re focused on developing cutting\\-edge technology, expanding into new global markets, and—above all–driving incredible value for our customers. Join us!\n   \n\n  \n\n We’re looking for a passionate\n **Software Engineer, Frontend (Mid\\-level to Staff)** \n to help us build beautiful, performant, and scalable user\\-facing experiences. In this role, you’ll take ownership of our core frontend architecture and ship features that have a direct and immediate impact on our customers.\n   \n\n  \n\n You'll collaborate closely with a highly skilled, cross\\-functional team that values thoughtful design, fast iteration, and clean, maintainable code. Our engineers have a high degree of autonomy and are trusted to take features from concept to production, all while contributing towards improving our frontend practices as a company.\n   \n\n  \n\n**You will**\n* Design and build highly reliable and resilient products and features.\n* Work closely with cross functional product and customer\\-facing teams to understand requirements and ship thoughtful solutions.\n* Write high\\-quality, extensible, and maintainable code.\n* Design and build scalable frontend applications and components.\n* Design and build APIs to drive existing and new features for a web\\-based application.\n\n\n**Qualifications**\n* 3\\+ years of experience in modern web app development\n* BS or higher, in Computer Science or technical field\n* Proficiency in React, TypeScript, browser APIs, and performance optimization\n* Experience with web application and API development in production environments. At Zip, our stack includes Python, Typescript, React, and GraphQL.\n* Experience with industry standard build, test, deploy tools. At Zip, we work with: Kubernetes, Spinnaker, Jenkins, Segment, Github Actions, Datadog, Bugsnag and Fullstory.\n* Ability and interest to quickly learn new frameworks and architecture patterns as needed\n* Experience working at a small company with diverse responsibilities is a bonus, but not required.\n\n\n The salary range for this role is $150,000 \\- $220,000\\. The salary for this position is determined based on a variety of job\\-related factors that may include location, relevant experience, education, or particular skills and expertise.\n   \n\n  \n\n**Perks \\& Benefits**\n At Zip, we’re committed to providing our employees with everything they need to do their best work.\n   \n\n  \n\n* 📈 Start\\-up equity\n* 🦷 Full health, vision \\& dental coverage\n* 🍽️ Catered lunches \\& dinners for SF employees\n* 🚍 Commuter benefit\n* 🚠 Team building events \\& happy hours\n* 🌴 Flexible PTO\n* 💻 Apple equipment plus home office budget\n* 💸 401k plan\n\n\n*We're looking to hire Zipsters and that means hiring people who take ownership, communicate openly, have an underdog mindset, and are excited to increase the pace of innovation for every business in the world. We encourage all candidates to apply even if your experience doesn't exactly match up to our job description. We are committed to building a diverse and inclusive workspace where everyone (regardless of age, religion, ethnicity, gender, sexual orientation, and more) feels like they belong. We look forward to hearing from you!*",
    "company_industry": "Software Development",
    "company_url": "https://www.linkedin.com/company/theziphq",
    "company_logo": "https://media.licdn.com/dms/image/v2/D560BAQE06hKRt1Z_1A/company-logo_100_100/B56Zfl1YOMHoAQ-/0/1751907665148/theziphq_logo?e=2147483647&v=beta&t=aY_k9ksXCWkgxlk7Zs8i1q7ipQEPHlXgWJO6JPMQwMw",
    "company_url_direct": null,
    "company_addresses": null,
    "company_num_employees": null,
    "company_revenue": null,
    "company_description": null,
    "skills": null,
    "experience_range": null,
    "company_rating": null,
    "company_reviews_count": null,
    "vacancy_count": null,
    "work_from_home_type": null,
    "keywords": [
      "Software Engineer",
      "Frontend",
      "React",
      "TypeScript",
      "JavaScript",
      "Web Development",
      "GraphQL",
      "Python",
      "API Development",
      "User Experience",
      "Scalable Applications",
      "Performance Optimization",
      "Cross-functional Collaboration",
      "Modern Web Technologies",
      "Production Environment",
      "Kubernetes",
      "CI/CD",
      "Full-stack Development",
      "SaaS Platform",
      "Procurement Software"
    ]
  },
  {
    "id": "li-4300005767",
    "site": "linkedin",
    "job_url": "https://www.linkedin.com/jobs/view/4300005767",
    "job_url_direct": "https://www.disneycareers.com/job/-/-/391/86030852576&urlHash=ipXW",
    "title": "Software Engineer I",
    "company": "The Walt Disney Company",
    "location": "Glendale, CA",
    "date_posted": 1757635200000,
    "job_type": "fulltime",
    "salary_source": null,
    "interval": null,
    "min_amount": null,
    "max_amount": null,
    "currency": null,
    "is_remote": false,
    "job_level": "mid-senior level",
    "job_function": "Information Technology",
    "listing_type": null,
    "emails": null,
    "description": "**Disney Entertainment and ESPN Product \\& Technology**\n Technology is at the heart of Disney’s past, present, and future. Disney Entertainment and ESPN Product \\& Technology is a global organization of engineers, product developers, designers, technologists, data scientists, and more – all working to build and advance the technological backbone for Disney’s media business globally.\n   \n\n  \n\n The team marries technology with creativity to build world\\-class products, enhance storytelling, and drive velocity, innovation, and scalability for our businesses. We are Storytellers and Innovators. Creators and Builders. Entertainers and Engineers. We work with every part of The Walt Disney Company’s media portfolio to advance the technological foundation and consumer media touch points serving millions of people around the world.\n   \n\n  \n\n We are specifically part of Product Engineering. This is a unified team responsible for the engineering of Disney Entertainment \\& ESPN digital and streaming products and platforms. This includes product engineering, media engineering, quality assurance, engineering behind personalization, commerce, lifecycle, and identity.\n   \n\n  \n\n Here are a few reasons why we think you’d love working here:\n   \n\n  \n\n  \n\n* Building the future of Disney’s media: Our Technologists are designing and building the products and platforms that will power our media, advertising, and distribution businesses for years to come.\n* Reach, Scale \\& Impact: More than ever, Disney’s technology and products serve as a signature doorway for fans' connections with the company’s brands and stories. Disney\\+. Hulu. ESPN. ABC. ABC News…and many more. These products and brands – and the unmatched stories, storytellers, and events they carry – matter to millions of people globally.\n* Innovation: We develop and implement groundbreaking products and techniques that shape industry norms and solve complex and distinctive technical problems.\n\n\n**Job Summary**\n Disney’s Android team is seeking a Software Engineer who is excited to build apps enjoyed by millions around the world. You will be building scalable, elegant solutions for the Disney\\+ Android application across a wide array of devices including phones, tablets, and TVs. Our highly collaborative group works in tandem with many cross\\-functional teams. We value pristine communication skills, both written and verbal, as well as a bias for action. We are incredibly invested in maintaining high code quality standards with unit tests, automated tests, modern libraries, and a Kotlin codebase. We strive to build the best Live and video\\-on\\-demand (VOD) applications in the world, and we look forward to hearing more about your skills and how they can help us achieve this lofty goal.\n   \n\n  \n\n**Responsibilities And Duties Of The Role**\n As Software Engineer working at Disney, you have some Android experience, and you are ready for more. The learning curve of contributing to a large project with a huge impact excites you, and your resilience will help you grow into a strong developer. You are eager to be coached and are receptive to feedback. You are equally comfortable chiming in on meetings and code reviews, giving a valuable perspective from an Software Engineer’s lens.\n   \n\n  \n\n**Basic Qualifications**\n* Quality communication skills who can collaborate well across teams\n* Comfortable with Git basics\n* Coachable and receptive to constructive feedback\n\n\n**Preferred Qualifications**\n* 1\\+ years of production experience with the Android SDK\n* Experience using common Android libraries\n* Experience with unit testing\n* Familiar with architectural patterns (MVI/MVVM or equivalent)\n* Some experience with Reactive Programming or Dependency Injection\n* Experience with Kotlin, Java, Android SDK, Dependency Injection, Gradle, Databases, Reactive paradigms, coroutines\n\n\n**Required Education**\n* Bachelor’s degree in Computer Science or comparable field of study, and/or equivalent work experience\n\n\n The hiring range for this position in Glendale, CA is 95,300\\-$127,800\\. The base pay actually offered will take into account internal equity and also may vary depending on the candidate’s geographic region, job\\-related knowledge, skills, and experience among other factors. A bonus and/or long\\-term incentive units may be provided as part of the compensation package, in addition to the full range of medical, financial, and/or other benefits, dependent on the level and position offered",
    "company_industry": "Entertainment Providers",
    "company_url": "https://www.linkedin.com/company/the-walt-disney-company",
    "company_logo": "https://media.licdn.com/dms/image/v2/D4E0BAQHScKuaJ_0-WA/company-logo_100_100/company-logo_100_100/0/1712695425017/the_walt_disney_company_logo?e=2147483647&v=beta&t=RNCX8SOfIyb101EpcMeT_VYVIEv4nLPFUGLsBZ8WEjg",
    "company_url_direct": null,
    "company_addresses": null,
    "company_num_employees": null,
    "company_revenue": null,
    "company_description": null,
    "skills": null,
    "experience_range": null,
    "company_rating": null,
    "company_reviews_count": null,
    "vacancy_count": null,
    "work_from_home_type": null,
    "keywords": [
      "Software Engineer",
      "Android",
      "Disney+",
      "Kotlin",
      "Java",
      "Android SDK",
      "Git",
      "Unit Testing",
      "MVVM",
      "MVI",
      "Reactive Programming",
      "Dependency Injection",
      "Gradle",
      "Databases",
      "Coroutines",
      "Streaming",
      "Mobile Development",
      "Cross-functional Teams",
      "Code Quality",
      "Bachelor's Degree"
    ]
  },
  {
    "id": "li-4289332289",
    "site": "linkedin",
    "job_url": "https://www.linkedin.com/jobs/view/4289332289",
    "job_url_direct": "https://jobs.lever.co/plaid/2b9a141e-0669-4197-aa52-2b07d9fadc96/apply?lever-origin=applied&lever-source=LinkedInPaid&urlHash=q6nP",
    "title": "Software Engineer - Platform",
    "company": "Plaid",
    "location": "New York, NY",
    "date_posted": 1757635200000,
    "job_type": "fulltime",
    "salary_source": null,
    "interval": null,
    "min_amount": null,
    "max_amount": null,
    "currency": null,
    "is_remote": false,
    "job_level": "mid-senior level",
    "job_function": "Engineering and Information Technology",
    "listing_type": null,
    "emails": "accommodations@plaid.com",
    "description": "We believe that the way people interact with their finances will drastically improve in the next few years. We’re dedicated to empowering this transformation by building the tools and experiences that thousands of developers use to create their own products. Plaid powers the tools millions of people rely on to live a healthier financial life. We work with thousands of companies like Venmo, SoFi, several of the Fortune 500, and many of the largest banks to make it easy for people to connect their financial accounts to the apps and services they want to use. Plaid’s network covers 12,000 financial institutions across the US, Canada, UK and Europe. Founded in 2013, the company is headquartered in San Francisco with offices in New York, Washington D.C., London and Amsterdam.\n   \n\n  \n\n Plaid’s Platform Engineering organization comprises multiple teams focused on core infrastructure, data platforms, storage, privacy, and developer efficiency. Together, these teams ensure that Plaid’s technology platform is scalable, reliable, and secure to support our rapid growth. Our infrastructure handles millions of requests per day, and we pride ourselves on maintaining highly robust and performant systems. As a Platform Engineer, you will design, build, and maintain the foundational infrastructure and internal platforms that empower all of Plaid’s engineering teams to move quickly and safely. You’ll work cross\\-functionally with product engineering squads to ship new features and ensure operational excellence throughout each product’s lifecycle.\n   \n\n  \n\n**Responsibilities**\n* Design \\& Develop Scalable Systems: Build and maintain core platform services with a focus on performance, reliability, and scalability. You will create and evolve distributed backend systems that serve as the bedrock for products used by millions of users.\n* Infrastructure \\& Data Platforms: Develop and improve infrastructure for data storage and processing – for example, high\\-performance databases and modern data processing frameworks – to handle Plaid’s growing data and product needs. Ensure our data infrastructure is robust and can scale effectively.\n* Developer Productivity Tools: Create internal tools, frameworks, and automation to improve developer productivity and efficiency. This includes building CI/CD pipelines, observability and monitoring systems, and self\\-service infrastructure platforms that enable teams to ship code quickly and safely.\n* Security \\& Privacy by Design: Integrate security, privacy, and compliance best practices into our platforms (e.g. data encryption, access controls, audit logging) to protect sensitive financial data. Work closely with Security and Privacy teams to ensure our infrastructure and internal services meet high standards for data protection and regulatory compliance.\n* Cross\\-Team Collaboration: Work hand\\-in\\-hand with product engineers and other stakeholders to understand requirements and translate them into reliable platform capabilities. Facilitate smooth integration of platform solutions into various products, and coordinate across teams to resolve issues and deliver new features efficiently.\n* Technical Excellence \\& Leadership: Uphold high engineering standards through code reviews, testing, and documentation. Take initiative in setting technical direction and architecture for platform systems, and mentor junior engineers to help grow their skills. You will lead by example in driving best practices and continuously improving the quality of our engineering solutions.\n\n\n**Qualifications**\n* Experience: 2 to 4 years of software engineering experience, with a proven track record of building and shipping complex backend systems or platforms. Experience designing and scaling distributed systems is highly desired.\n* Strong Coding Skills: Proficiency in at least one general\\-purpose programming language (e.g. Go, Python, Java, C\\+\\+). Our core services are built largely in Go, so experience with Go is a plus. You write clean, efficient, and maintainable code and have solid computer science fundamentals.\n* Distributed Systems \\& Problem Solving: Deep understanding of system design and algorithms. Hands\\-on experience with designing, building, and operating distributed systems or microservices architectures at scale. Ability to debug complex issues in a production environment and optimize system performance and reliability.\n* Data and Databases: Familiarity with relational and NoSQL database technologies (for example, MySQL/TiDB, PostgreSQL, MongoDB) and data storage architectures. Experience building data pipelines or working with big data processing frameworks (Spark, Databricks, etc.) is a plus.\n* Collaboration \\& Communication: Excellent communication and teamwork skills, with the ability to work effectively in a cross\\-functional environment. You can collaborate closely with other engineers, product managers, and stakeholders, and you’re able to explain complex technical concepts in simple terms when needed.\n\n\n $163,200 \\- $223,200 a year\n   \n\n  \n\n Target base salary for this role is between $163200 and $223200 per year. Additional compensation in the form(s) of equity and/or commission are dependent on the position offered. Plaid provides a comprehensive benefit plan, including medical, dental, vision, and 401(k). Pay is based on factors such as (but not limited to) scope and responsibilities of the position, candidate's work experience and skillset, and location. Pay and benefits are subject to change at any time, consistent with the terms of any applicable compensation or benefit plans.\n   \n\n  \n\n Our mission at Plaid is to unlock financial freedom for everyone. To support that mission, we seek to build a diverse team of driven individuals who care deeply about making the financial ecosystem more equitable. We recognize that strong qualifications can come from both prior work experiences and lived experiences. We encourage you to apply to a role even if your experience doesn't fully match the job description. We are always looking for team members that will bring something unique to Plaid!\n   \n\n  \n\n Plaid is proud to be an equal opportunity employer and values diversity at our company. We do not discriminate based on race, color, national origin, ethnicity, religion or religious belief, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, military or veteran status, disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state, and local laws. Plaid is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance with your application or interviews due to a disability, please let us know at accommodations@plaid.com.\n   \n\n  \n\n Please review our Candidate Privacy Notice here .",
    "company_industry": "Software Development, Technology, Information and Internet, and Financial Services",
    "company_url": "https://www.linkedin.com/company/plaid-",
    "company_logo": "https://media.licdn.com/dms/image/v2/D4E0BAQET1PssqfCU5g/company-logo_100_100/B4EZarmEzJGYAY-/0/1746635608257/plaid__logo?e=2147483647&v=beta&t=fiFr2KJFzSNufIcHLyRdsg9kzJviRTfZilOvCt99Hg0",
    "company_url_direct": null,
    "company_addresses": null,
    "company_num_employees": null,
    "company_revenue": null,
    "company_description": null,
    "skills": null,
    "experience_range": null,
    "company_rating": null,
    "company_reviews_count": null,
    "vacancy_count": null,
    "work_from_home_type": null,
    "keywords": [
      "Software Engineer",
      "Platform",
      "Backend Systems",
      "Distributed Systems",
      "Scalable Systems",
      "Infrastructure",
      "Data Platforms",
      "Go",
      "Python",
      "Java",
      "CI/CD",
      "Security",
      "Privacy",
      "Microservices",
      "Database",
      "MySQL",
      "PostgreSQL",
      "MongoDB",
      "System Design",
      "Developer Tools",
      "Cross-functional"
    ]
  },
  {
    "id": "li-4289439367",
    "site": "linkedin",
    "job_url": "https://www.linkedin.com/jobs/view/4289439367",
    "job_url_direct": "https://job-boards.greenhouse.io/togetherai/jobs/4835292007?gh_src=fbe3b70a7us&urlHash=M5PR",
    "title": "Software Engineer - New Grad",
    "company": "Together AI",
    "location": "San Francisco, CA",
    "date_posted": 1757635200000,
    "job_type": "fulltime",
    "salary_source": null,
    "interval": null,
    "min_amount": null,
    "max_amount": null,
    "currency": null,
    "is_remote": false,
    "job_level": "entry level",
    "job_function": "Engineering and Information Technology",
    "listing_type": null,
    "emails": null,
    "description": "****About Together AI****\n Together AI is a research\\-driven AI company. We believe open and transparent AI systems will drive innovation and create the best outcomes for society, and together we are on a mission to lower the cost of modern AI systems by co\\-designing software, hardware, algorithms, and models. We have contributed to leading open\\-source research, models, and datasets to advance the frontier of AI. We invite you to join a passionate group of researchers and engineers in our journey in building the next generation AI infrastructure.\n   \n\n  \n\n****Role Overview****\n As an early career Software Engineer, you’ll work on a variety of projects, from designing scalable systems, building product features, to optimizing performance\\-critical code. You’ll collaborate with cross\\-functional teams to build robust, user\\-focused solutions and contribute to our mission of delivering cutting\\-edge technology. This role is ideal for recent graduates with a strong foundation in software development and a passion for learning.\n   \n\n  \n\n****Responsibilities****\n* Design, develop, and maintain high\\-quality software across our tech stack from low\\-level system to customer\\-facing UIs\n* Collaborate with product managers, designers, and engineers to deliver features and improvements.\n* Write clean, efficient, and well\\-documented code with a focus on maintainability.\n* Participate in code reviews, debugging, and performance optimization.\n* Contribute ideas to shape the direction of our products and technical infrastructure.\n* Learn and adapt to new tools, technologies, and frameworks as needed.\n\n\n****Qualifications****\n* Bachelor’s degree (or equivalent) in Computer Science, Software Engineering, or a related field, earned or expected by Summer 2026\\.\n* Excellent programming skills\n* Experience with version control systems (e.g., Git) and collaborative development workflows.\n* Ability to solve problems creatively and communicate trade\\-offs effectively.\n* Enthusiasm for learning and thriving in a fast\\-paced, collaborative environment.\n* Bonus: Experience with web development, databases, distributed systems, or cloud platforms, OSS contributions.\n\n\n We encourage all passionate new grads to apply, even if you don’t meet every qualification. Join us in building the future!\n   \n\n  \n\n****About Together AI****\n Together AI is a research\\-driven artificial intelligence company. We believe open and transparent AI systems will drive innovation and create the best outcomes for society, and together we are on a mission to significantly lower the cost of modern AI systems by co\\-designing software, hardware, algorithms, and models. We have contributed to leading open\\-source research, models, and datasets to advance the frontier of AI, and our team has been behind technological advancement such as FlashAttention, Hyena, FlexGen, and RedPajama. We invite you to join a passionate group of researchers and engineers in our journey in building the next generation AI infrastructure.\n   \n\n  \n\n****Compensation****\n We offer competitive compensation, startup equity, health insurance and other competitive benefits. The US base salary range for this full\\-time position is: $150,000 \\- $200,000 \\+ equity \\+ benefits. Our salary ranges are determined by location, level and role. Individual compensation will be determined by experience, skills, and job\\-related knowledge.\n   \n\n  \n\n**Equal Opportunity**\n Together AI is an Equal Opportunity Employer and is proud to offer equal employment opportunity to everyone regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, veteran status, and more.\n   \n\n  \n\n Please see our privacy policy at https://www.together.ai/privacy",
    "company_industry": "Software Development",
    "company_url": "https://www.linkedin.com/company/togethercomputer",
    "company_logo": "https://media.licdn.com/dms/image/v2/D560BAQEoABGv7fhdYw/company-logo_100_100/B56ZaIpAzHHAAQ-/0/1746049174960/togethercomputer_logo?e=2147483647&v=beta&t=ulLtyVP63FaYpjPzb0jIsS841k0VuVmjozIf7civ3dE",
    "company_url_direct": null,
    "company_addresses": null,
    "company_num_employees": null,
    "company_revenue": null,
    "company_description": null,
    "skills": null,
    "experience_range": null,
    "company_rating": null,
    "company_reviews_count": null,
    "vacancy_count": null,
    "work_from_home_type": null,
    "keywords": [
      "Software Engineer",
      "New Grad",
      "AI",
      "programming",
      "Python",
      "JavaScript",
      "Git",
      "version control",
      "Bachelor's degree",
      "Computer Science",
      "web development",
      "databases",
      "distributed systems",
      "cloud platforms",
      "scalable systems",
      "performance optimization",
      "code reviews",
      "cross-functional teams",
      "open-source",
      "startup"
    ]
  },
  {
    "id": "li-4289334142",
    "site": "linkedin",
    "job_url": "https://www.linkedin.com/jobs/view/4289334142",
    "job_url_direct": "https://jobs.lever.co/plaid/2b9a141e-0669-4197-aa52-2b07d9fadc96/apply?lever-origin=applied&lever-source=LinkedInPaid&urlHash=q6nP",
    "title": "Software Engineer - Platform",
    "company": "Plaid",
    "location": "San Francisco, CA",
    "date_posted": 1757635200000,
    "job_type": "fulltime",
    "salary_source": null,
    "interval": null,
    "min_amount": null,
    "max_amount": null,
    "currency": null,
    "is_remote": false,
    "job_level": "mid-senior level",
    "job_function": "Engineering and Information Technology",
    "listing_type": null,
    "emails": "accommodations@plaid.com",
    "description": "We believe that the way people interact with their finances will drastically improve in the next few years. We’re dedicated to empowering this transformation by building the tools and experiences that thousands of developers use to create their own products. Plaid powers the tools millions of people rely on to live a healthier financial life. We work with thousands of companies like Venmo, SoFi, several of the Fortune 500, and many of the largest banks to make it easy for people to connect their financial accounts to the apps and services they want to use. Plaid’s network covers 12,000 financial institutions across the US, Canada, UK and Europe. Founded in 2013, the company is headquartered in San Francisco with offices in New York, Washington D.C., London and Amsterdam.\n   \n\n  \n\n Plaid’s Platform Engineering organization comprises multiple teams focused on core infrastructure, data platforms, storage, privacy, and developer efficiency. Together, these teams ensure that Plaid’s technology platform is scalable, reliable, and secure to support our rapid growth. Our infrastructure handles millions of requests per day, and we pride ourselves on maintaining highly robust and performant systems. As a Platform Engineer, you will design, build, and maintain the foundational infrastructure and internal platforms that empower all of Plaid’s engineering teams to move quickly and safely. You’ll work cross\\-functionally with product engineering squads to ship new features and ensure operational excellence throughout each product’s lifecycle.\n   \n\n  \n\n**Responsibilities**\n* Design \\& Develop Scalable Systems: Build and maintain core platform services with a focus on performance, reliability, and scalability. You will create and evolve distributed backend systems that serve as the bedrock for products used by millions of users.\n* Infrastructure \\& Data Platforms: Develop and improve infrastructure for data storage and processing – for example, high\\-performance databases and modern data processing frameworks – to handle Plaid’s growing data and product needs. Ensure our data infrastructure is robust and can scale effectively.\n* Developer Productivity Tools: Create internal tools, frameworks, and automation to improve developer productivity and efficiency. This includes building CI/CD pipelines, observability and monitoring systems, and self\\-service infrastructure platforms that enable teams to ship code quickly and safely.\n* Security \\& Privacy by Design: Integrate security, privacy, and compliance best practices into our platforms (e.g. data encryption, access controls, audit logging) to protect sensitive financial data. Work closely with Security and Privacy teams to ensure our infrastructure and internal services meet high standards for data protection and regulatory compliance.\n* Cross\\-Team Collaboration: Work hand\\-in\\-hand with product engineers and other stakeholders to understand requirements and translate them into reliable platform capabilities. Facilitate smooth integration of platform solutions into various products, and coordinate across teams to resolve issues and deliver new features efficiently.\n* Technical Excellence \\& Leadership: Uphold high engineering standards through code reviews, testing, and documentation. Take initiative in setting technical direction and architecture for platform systems, and mentor junior engineers to help grow their skills. You will lead by example in driving best practices and continuously improving the quality of our engineering solutions.\n\n\n**Qualifications**\n* Experience: 2 to 4 years of software engineering experience, with a proven track record of building and shipping complex backend systems or platforms. Experience designing and scaling distributed systems is highly desired.\n* Strong Coding Skills: Proficiency in at least one general\\-purpose programming language (e.g. Go, Python, Java, C\\+\\+). Our core services are built largely in Go, so experience with Go is a plus. You write clean, efficient, and maintainable code and have solid computer science fundamentals.\n* Distributed Systems \\& Problem Solving: Deep understanding of system design and algorithms. Hands\\-on experience with designing, building, and operating distributed systems or microservices architectures at scale. Ability to debug complex issues in a production environment and optimize system performance and reliability.\n* Data and Databases: Familiarity with relational and NoSQL database technologies (for example, MySQL/TiDB, PostgreSQL, MongoDB) and data storage architectures. Experience building data pipelines or working with big data processing frameworks (Spark, Databricks, etc.) is a plus.\n* Collaboration \\& Communication: Excellent communication and teamwork skills, with the ability to work effectively in a cross\\-functional environment. You can collaborate closely with other engineers, product managers, and stakeholders, and you’re able to explain complex technical concepts in simple terms when needed.\n\n\n $163,200 \\- $223,200 a year\n   \n\n  \n\n Target base salary for this role is between $163200 and $223200 per year. Additional compensation in the form(s) of equity and/or commission are dependent on the position offered. Plaid provides a comprehensive benefit plan, including medical, dental, vision, and 401(k). Pay is based on factors such as (but not limited to) scope and responsibilities of the position, candidate's work experience and skillset, and location. Pay and benefits are subject to change at any time, consistent with the terms of any applicable compensation or benefit plans.\n   \n\n  \n\n Our mission at Plaid is to unlock financial freedom for everyone. To support that mission, we seek to build a diverse team of driven individuals who care deeply about making the financial ecosystem more equitable. We recognize that strong qualifications can come from both prior work experiences and lived experiences. We encourage you to apply to a role even if your experience doesn't fully match the job description. We are always looking for team members that will bring something unique to Plaid!\n   \n\n  \n\n Plaid is proud to be an equal opportunity employer and values diversity at our company. We do not discriminate based on race, color, national origin, ethnicity, religion or religious belief, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, military or veteran status, disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state, and local laws. Plaid is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance with your application or interviews due to a disability, please let us know at accommodations@plaid.com.\n   \n\n  \n\n Please review our Candidate Privacy Notice here .",
    "company_industry": "Software Development, Technology, Information and Internet, and Financial Services",
    "company_url": "https://www.linkedin.com/company/plaid-",
    "company_logo": "https://media.licdn.com/dms/image/v2/D4E0BAQET1PssqfCU5g/company-logo_100_100/B4EZarmEzJGYAY-/0/1746635608257/plaid__logo?e=2147483647&v=beta&t=fiFr2KJFzSNufIcHLyRdsg9kzJviRTfZilOvCt99Hg0",
    "company_url_direct": null,
    "company_addresses": null,
    "company_num_employees": null,
    "company_revenue": null,
    "company_description": null,
    "skills": null,
    "experience_range": null,
    "company_rating": null,
    "company_reviews_count": null,
    "vacancy_count": null,
    "work_from_home_type": null,
    "keywords": [
      "Software Engineer",
      "Platform Engineering",
      "Backend Systems",
      "Distributed Systems",
      "Scalable Systems",
      "Infrastructure",
      "Data Platforms",
      "Go",
      "Python",
      "Java",
      "Developer Productivity",
      "CI/CD",
      "Security",
      "Privacy",
      "Financial Technology",
      "API",
      "Database",
      "PostgreSQL",
      "MySQL",
      "Microservices",
      "Cloud"
    ]
  },
  {
    "id": "li-4297704292",
    "site": "linkedin",
    "job_url": "https://www.linkedin.com/jobs/view/4297704292",
    "job_url_direct": "https://jobs.ebayinc.com/us/en/job/EBAEBAUSR0069693EXTERNALENUS/Software-Engineer-Frontend-eBay-Live?utm_source=linkedin&utm_medium=phenom-feeds&urlHash=42o3",
    "title": "Software Engineer - Frontend - eBay Live",
    "company": "eBay",
    "location": "Bellevue, WA",
    "date_posted": 1757548800000,
    "job_type": "fulltime",
    "salary_source": null,
    "interval": null,
    "min_amount": null,
    "max_amount": null,
    "currency": null,
    "is_remote": true,
    "job_level": "mid-senior level",
    "job_function": "Engineering and Information Technology",
    "listing_type": null,
    "emails": "talent@ebay.com",
    "description": "At eBay, we're more than a global ecommerce leader — we’re changing the way the world shops and sells. Our platform empowers millions of buyers and sellers in more than 190 markets around the world. We’re committed to pushing boundaries and leaving our mark as we reinvent the future of ecommerce for enthusiasts.\n   \n\n  \n\n Our customers are our compass, authenticity thrives, bold ideas are welcome, and everyone can bring their unique selves to work — every day. We're in this together, sustaining the future of our customers, our company, and our planet.\n   \n\n  \n\n Join a team of passionate thinkers, innovators, and dreamers — and help us connect people and build communities to create economic opportunity for all.\n   \n\n  \n\n**About The Team And The Role**\n eBay Live is our interactive livestream shopping platform that brings the excitement of in\\-person auctions and sales directly to online buyers. It allows sellers to showcase products in real time, engage with viewers through live chat, and create a dynamic, community\\-driven shopping experience. For buyers, it’s a chance to discover unique items, ask questions instantly, and purchase with confidence. By combining the reach of eBay’s global marketplace with the energy of live commerce, eBay Live is redefining how people connect, shop, and sell.\n   \n\n  \n\n**What You'll Do And Learn**\n* Build scalable, reliable frontend features in a distributed environment.\n* Translate product/design into clean, tested, maintainable code.\n* Write automation tests, practice CI/CD, and conduct code reviews.\n* Own subsystems end\\-to\\-end: design, development, deployment, monitoring.\n* Evaluate design options, provide estimates, and meet milestones independently.\n* Communicate clearly with stakeholders to ensure alignment.\n* Support releases, on\\-call, and 24/7 site reliability.\n\n\n**What We Bring**\n* Impactful mission: Redefining eBay’s buyer and seller experiences with simplification, personalization, modernization, and cutting\\-edge tech (including Generative AI).\n* Vibrant culture: Diverse, transparent, collaborative, celebrating successes and fostering growth.\n* Flexible Working \\- Enjoy exceptional support for remote work, allowing you to balance your professional and personal life seamlessly.\n* Competitive Compensation and Benefit \\- No matter where you are in the world, eBay supports your health and wellbeing with benefits as unique as you. Explore the benefits that help you be your best self. Check out our benefits here: https://www.ebaybenefits.com/index.html.\n\n\n**Qualifications**\n* Bachelor's degree in EE, CS or other related field.\n* 4\\+ years of experience working in front\\-end development using Javascript/Typescript, CSS, React, NodeJS\n* Server\\-side rendering using one of the open\\-sourced UI libraries (Material UI/Ant UI), Integration with REST/GraphQL APIs\n* Strong portfolio demonstrating BEM\\-structured CSS and understand the intricacies of how browsers work\n* Strong CS foundation (Data structures, Algorithms, Functional Programming)\n* Delivers results in fast\\-paced environments (agile, TDD, CI/CD)\n* Designs and builds scalable, distributed, available systems\n\n\n The applicable base pay range for this position is dependent on work location. The base pay range in the San Francisco Bay Area, New York City Metro and Seattle Metro is expected in the range below:\n   \n\n  \n\n $142,400 \\- $190,100\n   \n\n  \n\n The base pay range for all other U.S. work locations is expected in the range below:\n   \n\n  \n\n $95,200 \\- $168,700\n   \n\n  \n\n Base pay offered may vary depending on multiple individualized factors, including location, skills, and experience. The total compensation package for this position may also include other elements, including a target bonus and restricted stock units (as applicable) in addition to a full range of medical, financial, and/or other benefits (including 401(k) eligibility and various paid time off benefits, such as PTO and parental leave). Details of participation in these benefit plans will be provided if an employee receives an offer of employment.\n   \n\n  \n\n If hired, employees will be in an “at\\-will position” and the Company reserves the right to modify base salary (as well as any other discretionary payment or compensation program) at any time, including for reasons related to individual performance, Company or individual department/team performance, and market factors.\n   \n\n  \n\n Please see the Talent Privacy Notice for information regarding how eBay handles your personal data collected when you use the eBay Careers website or apply for a job with eBay.\n   \n\n  \n\n eBay is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, sex, sexual orientation, gender identity, veteran status, and disability, or other legally protected status. If you have a need that requires accommodation, please contact us at talent@ebay.com. We will make every effort to respond to your request for accommodation as soon as possible. View our accessibility statement to learn more about eBay's commitment to ensuring digital accessibility for people with disabilities. It is unlawful in Massachusetts to require or administer a lie detector test as a condition of employment or continued employment. An employer who violates this law shall be subject to criminal penalties and civil liability.\n   \n\n  \n\n The eBay Jobs website uses cookies to enhance your experience. By continuing to browse the site, you agree to our use of cookies. Visit our Privacy Center for more information.",
    "company_industry": "Technology, Information and Internet",
    "company_url": "https://www.linkedin.com/company/ebay",
    "company_logo": "https://media.licdn.com/dms/image/v2/C560BAQFfGj-Xuawo6A/company-logo_100_100/company-logo_100_100/0/1634568184469/ebay_logo?e=2147483647&v=beta&t=BEp-EQMNBexZVYGMcq6jeof_bX8QzuCCq4BEG6UCRdM",
    "company_url_direct": null,
    "company_addresses": null,
    "company_num_employees": null,
    "company_revenue": null,
    "company_description": null,
    "skills": null,
    "experience_range": null,
    "company_rating": null,
    "company_reviews_count": null,
    "vacancy_count": null,
    "work_from_home_type": null,
    "keywords": [
      "JavaScript",
      "TypeScript",
      "React",
      "NodeJS",
      "CSS",
      "Frontend Development",
      "REST APIs",
      "GraphQL",
      "Server-side Rendering",
      "Material UI",
      "Ant UI",
      "BEM CSS",
      "CI/CD",
      "TDD",
      "Agile",
      "Distributed Systems",
      "Bachelor's Degree",
      "Computer Science",
      "Code Reviews",
      "Scalable Systems"
    ]
  },
  {
    "id": "li-4297713214",
    "site": "linkedin",
    "job_url": "https://www.linkedin.com/jobs/view/4297713214",
    "job_url_direct": "https://jobs.ebayinc.com/us/en/job/EBAEBAUSR0069693EXTERNALENUS/Software-Engineer-Frontend-eBay-Live?utm_source=linkedin&utm_medium=phenom-feeds&urlHash=42o3",
    "title": "Software Engineer - Frontend - eBay Live",
    "company": "eBay",
    "location": "San Jose, CA",
    "date_posted": 1757548800000,
    "job_type": "fulltime",
    "salary_source": null,
    "interval": null,
    "min_amount": null,
    "max_amount": null,
    "currency": null,
    "is_remote": true,
    "job_level": "mid-senior level",
    "job_function": "Engineering and Information Technology",
    "listing_type": null,
    "emails": "talent@ebay.com",
    "description": "At eBay, we're more than a global ecommerce leader — we’re changing the way the world shops and sells. Our platform empowers millions of buyers and sellers in more than 190 markets around the world. We’re committed to pushing boundaries and leaving our mark as we reinvent the future of ecommerce for enthusiasts.\n   \n\n  \n\n Our customers are our compass, authenticity thrives, bold ideas are welcome, and everyone can bring their unique selves to work — every day. We're in this together, sustaining the future of our customers, our company, and our planet.\n   \n\n  \n\n Join a team of passionate thinkers, innovators, and dreamers — and help us connect people and build communities to create economic opportunity for all.\n   \n\n  \n\n**About The Team And The Role**\n eBay Live is our interactive livestream shopping platform that brings the excitement of in\\-person auctions and sales directly to online buyers. It allows sellers to showcase products in real time, engage with viewers through live chat, and create a dynamic, community\\-driven shopping experience. For buyers, it’s a chance to discover unique items, ask questions instantly, and purchase with confidence. By combining the reach of eBay’s global marketplace with the energy of live commerce, eBay Live is redefining how people connect, shop, and sell.\n   \n\n  \n\n**What You'll Do And Learn**\n* Build scalable, reliable frontend features in a distributed environment.\n* Translate product/design into clean, tested, maintainable code.\n* Write automation tests, practice CI/CD, and conduct code reviews.\n* Own subsystems end\\-to\\-end: design, development, deployment, monitoring.\n* Evaluate design options, provide estimates, and meet milestones independently.\n* Communicate clearly with stakeholders to ensure alignment.\n* Support releases, on\\-call, and 24/7 site reliability.\n\n\n**What We Bring**\n* Impactful mission: Redefining eBay’s buyer and seller experiences with simplification, personalization, modernization, and cutting\\-edge tech (including Generative AI).\n* Vibrant culture: Diverse, transparent, collaborative, celebrating successes and fostering growth.\n* Flexible Working \\- Enjoy exceptional support for remote work, allowing you to balance your professional and personal life seamlessly.\n* Competitive Compensation and Benefit \\- No matter where you are in the world, eBay supports your health and wellbeing with benefits as unique as you. Explore the benefits that help you be your best self. Check out our benefits here: https://www.ebaybenefits.com/index.html.\n\n\n**Qualifications**\n* Bachelor's degree in EE, CS or other related field.\n* 4\\+ years of experience working in front\\-end development using Javascript/Typescript, CSS, React, NodeJS\n* Server\\-side rendering using one of the open\\-sourced UI libraries (Material UI/Ant UI), Integration with REST/GraphQL APIs\n* Strong portfolio demonstrating BEM\\-structured CSS and understand the intricacies of how browsers work\n* Strong CS foundation (Data structures, Algorithms, Functional Programming)\n* Delivers results in fast\\-paced environments (agile, TDD, CI/CD)\n* Designs and builds scalable, distributed, available systems\n\n\n The applicable base pay range for this position is dependent on work location. The base pay range in the San Francisco Bay Area, New York City Metro and Seattle Metro is expected in the range below:\n   \n\n  \n\n $142,400 \\- $190,100\n   \n\n  \n\n The base pay range for all other U.S. work locations is expected in the range below:\n   \n\n  \n\n $95,200 \\- $168,700\n   \n\n  \n\n Base pay offered may vary depending on multiple individualized factors, including location, skills, and experience. The total compensation package for this position may also include other elements, including a target bonus and restricted stock units (as applicable) in addition to a full range of medical, financial, and/or other benefits (including 401(k) eligibility and various paid time off benefits, such as PTO and parental leave). Details of participation in these benefit plans will be provided if an employee receives an offer of employment.\n   \n\n  \n\n If hired, employees will be in an “at\\-will position” and the Company reserves the right to modify base salary (as well as any other discretionary payment or compensation program) at any time, including for reasons related to individual performance, Company or individual department/team performance, and market factors.\n   \n\n  \n\n Please see the Talent Privacy Notice for information regarding how eBay handles your personal data collected when you use the eBay Careers website or apply for a job with eBay.\n   \n\n  \n\n eBay is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, sex, sexual orientation, gender identity, veteran status, and disability, or other legally protected status. If you have a need that requires accommodation, please contact us at talent@ebay.com. We will make every effort to respond to your request for accommodation as soon as possible. View our accessibility statement to learn more about eBay's commitment to ensuring digital accessibility for people with disabilities. It is unlawful in Massachusetts to require or administer a lie detector test as a condition of employment or continued employment. An employer who violates this law shall be subject to criminal penalties and civil liability.\n   \n\n  \n\n The eBay Jobs website uses cookies to enhance your experience. By continuing to browse the site, you agree to our use of cookies. Visit our Privacy Center for more information.",
    "company_industry": "Technology, Information and Internet",
    "company_url": "https://www.linkedin.com/company/ebay",
    "company_logo": "https://media.licdn.com/dms/image/v2/C560BAQFfGj-Xuawo6A/company-logo_100_100/company-logo_100_100/0/1634568184469/ebay_logo?e=2147483647&v=beta&t=BEp-EQMNBexZVYGMcq6jeof_bX8QzuCCq4BEG6UCRdM",
    "company_url_direct": null,
    "company_addresses": null,
    "company_num_employees": null,
    "company_revenue": null,
    "company_description": null,
    "skills": null,
    "experience_range": null,
    "company_rating": null,
    "company_reviews_count": null,
    "vacancy_count": null,
    "work_from_home_type": null,
    "keywords": [
      "JavaScript",
      "TypeScript",
      "React",
      "CSS",
      "Frontend Development",
      "NodeJS",
      "REST APIs",
      "GraphQL",
      "Server-side Rendering",
      "Material UI",
      "Ant UI",
      "BEM CSS",
      "CI/CD",
      "Agile",
      "TDD",
      "Distributed Systems",
      "Computer Science",
      "Data Structures",
      "Algorithms",
      "Code Reviews"
    ]
  },
  {
    "id": "li-4265604833",
    "site": "linkedin",
    "job_url": "https://www.linkedin.com/jobs/view/4265604833",
    "job_url_direct": "https://nuro.ai/careersitem?gh_jid=7066706&gh_src=bcd22a501us&urlHash=lPaG",
    "title": "Software Engineer, Routing - New Grad",
    "company": "Nuro",
    "location": "Mountain View, CA",
    "date_posted": null,
    "job_type": "fulltime",
    "salary_source": null,
    "interval": null,
    "min_amount": null,
    "max_amount": null,
    "currency": null,
    "is_remote": false,
    "job_level": "entry level",
    "job_function": "Engineering and Information Technology",
    "listing_type": null,
    "emails": null,
    "description": "**Who We Are**\n Nuro is a self\\-driving technology company on a mission to make autonomy accessible to all. Founded in 2016, Nuro is building the world’s most scalable driver, combining cutting\\-edge AI with automotive\\-grade hardware. Nuro licenses its core technology, the Nuro Driver™, to support a wide range of applications, from robotaxis and commercial fleets to personally owned vehicles. With technology proven over years of self\\-driving deployments, Nuro gives the automakers and mobility platforms a clear path to AVs at commercial scale—empowering a safer, richer, and more connected future.\n   \n\n  \n\n**About The Role**\n The Routing Team builds critical services that determine the routes our robots take to reach their destinations safely and efficiently. The team also owns a suite of simulation tools that have deep influence on the company’s strategy on robot deployment and business expansion. We are constantly working towards computing more efficient routes and providing more accurate ETAs, to empower both L2 and L4 AV commercialization.\n   \n\n  \n\n**About The Work**\n* You will work on building and scaling the backend systems for the Routing team. This includes everything from designing microservices, optimizing our routing algorithms, understanding road network graphs, building monitoring and analytics infrastructure etc.\n* You will work with product, strategy, and operations teams to design and build new user experiences, and define our product strategy and roadmap.\n\n\n**About You** \n  \n\n  \n\n- Technical excellence.\n\n* You have experience of building and scaling real\\-time server\\-side applications. You have worked on large\\-scale complex algorithm problems, and know how to balance correctness and performance.\n* You are proficient in C\\+\\+, Go, or Python.\n* You know how to choose the right storage technology for the job. You have experience with a wide\\-range of databases, including relational (PostgreSQL, MySQL), non\\-relational (BigTable, Cassandra, Redis, etc), and data warehouses (BigQuery, Snowflake, etc).\n* You know your way around RPC frameworks (gRPC, Thrift) and pubsub systems (Kafka, Cloud PubSub, Celery, etc).\n* You have extensive experience working with cloud providers (GCP, AWS, etc).\n* You have experience working with Docker \\& Kubernetes, or are willing to learn.\n* You have a wide\\-range of technical skills, you love learning new technologies and you’re a quick learner.\n* You have a passion for making lives easier for developers. You love working on tooling that will help engineers more easily troubleshoot, debug, and profile their applications.\n* You have the knack for making the right tradeoffs. You know when it makes sense to take the quick\\-and\\-dirty vs the scalable approach. You can move fluently between the two.\n* You care about users. You like to work closely with product and design to build the best product for our consumers.\n* You are a great communicator, and you regularly chat with PMs, UXRs, other engineers, and cross\\-functional stakeholders on product requirements and designs.\n* You are impact\\-driven. You care deeply that your work makes a significant impact on the lives of millions of people.\n\n\n**Bonus Points**\n* Experience with routing algorithms\n* Experience with map data and graph data structures\n* Experience with robotics\n* Experience with ETA modeling\n\n\n At Nuro, your base pay is one part of your total compensation package. For this position, the reasonably expected base pay range is between $145,000 and $170,000 for the level at which this job has been scoped. Your base pay will depend on several factors, including your experience, qualifications, education, location, and skills. In the event that you are considered for a different level, a higher or lower pay range would apply. This position is also eligible for an annual performance bonus, equity, and a competitive benefits package\n   \n\n  \n\n*At Nuro, we celebrate differences and are committed to a diverse workplace that fosters inclusion and psychological safety for all employees. Nuro is proud to be an equal opportunity employer and expressly prohibits any form of workplace discrimination based on race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, genetic information, disability, veteran status, or any other legally protected characteristics.*",
    "company_industry": "Software Development",
    "company_url": "https://www.linkedin.com/company/nuro-inc.",
    "company_logo": "https://media.licdn.com/dms/image/v2/C560BAQHahNycmNp6Gg/company-logo_100_100/company-logo_100_100/0/1630638403898/nuro_inc_logo?e=2147483647&v=beta&t=3FVrqvduIGtnaH7-fVEnLalZbqxzzCLA1ALuQ76cgmc",
    "company_url_direct": null,
    "company_addresses": null,
    "company_num_employees": null,
    "company_revenue": null,
    "company_description": null,
    "skills": null,
    "experience_range": null,
    "company_rating": null,
    "company_reviews_count": null,
    "vacancy_count": null,
    "work_from_home_type": null,
    "keywords": [
      "Software Engineer",
      "Backend Systems",
      "Routing Algorithms",
      "Microservices",
      "C++",
      "Go",
      "Python",
      "PostgreSQL",
      "MySQL",
      "Redis",
      "gRPC",
      "Kafka",
      "Cloud Computing",
      "AWS",
      "GCP",
      "Docker",
      "Kubernetes",
      "Real-time Applications",
      "Graph Data Structures",
      "Self-driving Technology"
    ]
  }
]
